HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxGtm_regdef.h
/** \\brief  BRC IRQ Mode Configuration Register */
typedef struct _Ifx_GTM_BRC_IRQ_MODE_Bits
{
    Ifx_Strict_32Bit IRQ_MODE:2;            /**< \brief [1:0] IRQ mode selection (rw) */
    Ifx_Strict_32Bit reserved_2:30;         /**< \brief \internal Reserved */
} Ifx_GTM_BRC_IRQ_MODE_Bits;

/** \\brief  BRC Interrupt Notification Register */
typedef struct _Ifx_GTM_BRC_IRQ_NOTIFY_Bits
{
    Ifx_Strict_32Bit DEST_ERR:1;            /**< \brief [0:0] Configuration error interrupt for BRC submodule (rwh) */
    Ifx_Strict_32Bit DIDx:12;               /**< \brief [12:1] Data inconsistency occurred in MTM mode (rwh) */
    Ifx_Strict_32Bit reserved_13:19;        /**< \brief \internal Reserved */
} Ifx_GTM_BRC_IRQ_NOTIFY_Bits;

/** \\brief  BRC Software Reset Register */
typedef struct _Ifx_GTM_BRC_RST_Bits
{
    Ifx_Strict_32Bit RST:1;                 /**< \brief [0:0] Software reset (w) */
    Ifx_Strict_32Bit reserved_1:31;         /**< \brief \internal Reserved */
} Ifx_GTM_BRC_RST_Bits;

/** \\brief  Read Address For Input Channel */
typedef struct _Ifx_GTM_BRC_SRC_ADDR_Bits
{
    Ifx_Strict_32Bit ADDR:9;                /**< \brief [8:0] Source ARU address (rw) */
    Ifx_Strict_32Bit reserved_9:3;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit BRC_MODE:1;            /**< \brief [12:12] BRC Operation mode select (rw) */
    Ifx_Strict_32Bit reserved_13:19;        /**< \brief \internal Reserved */
} Ifx_GTM_BRC_SRC_ADDR_Bits;

/** \\brief  Destination Channels For Input Channel */
typedef struct _Ifx_GTM_BRC_SRC_DEST_Bits
{
    Ifx_Strict_32Bit EN_DEST0:1;            /**< \brief [0:0] Enable BRC destination address 0 (rw) */
    Ifx_Strict_32Bit EN_DEST1:1;            /**< \brief [1:1] Enable BRC destination address 1 (rw) */
    Ifx_Strict_32Bit EN_DEST2:1;            /**< \brief [2:2] Enable BRC destination address 2 (rw) */
    Ifx_Strict_32Bit EN_DEST3:1;            /**< \brief [3:3] Enable BRC destination address 3 (rw) */
    Ifx_Strict_32Bit EN_DEST4:1;            /**< \brief [4:4] Enable BRC destination address 4 (rw) */
    Ifx_Strict_32Bit EN_DEST5:1;            /**< \brief [5:5] Enable BRC destination address 5 (rw) */
    Ifx_Strict_32Bit EN_DEST6:1;            /**< \brief [6:6] Enable BRC destination address 6 (rw) */
    Ifx_Strict_32Bit EN_DEST7:1;            /**< \brief [7:7] Enable BRC destination address 7 (rw) */
    Ifx_Strict_32Bit EN_DEST8:1;            /**< \brief [8:8] Enable BRC destination address 8 (rw) */
    Ifx_Strict_32Bit EN_DEST9:1;            /**< \brief [9:9] Enable BRC destination address 9 (rw) */
    Ifx_Strict_32Bit EN_DEST10:1;           /**< \brief [10:10] Enable BRC destination address 10 (rw) */
    Ifx_Strict_32Bit EN_DEST11:1;           /**< \brief [11:11] Enable BRC destination address 11 (rw) */
    Ifx_Strict_32Bit EN_DEST12:1;           /**< \brief [12:12] Enable BRC destination address 12 (rw) */
    Ifx_Strict_32Bit EN_DEST13:1;           /**< \brief [13:13] Enable BRC destination address 13 (rw) */
    Ifx_Strict_32Bit EN_DEST14:1;           /**< \brief [14:14] Enable BRC destination address 14 (rw) */
    Ifx_Strict_32Bit EN_DEST15:1;           /**< \brief [15:15] Enable BRC destination address 15 (rw) */
    Ifx_Strict_32Bit EN_DEST16:1;           /**< \brief [16:16] Enable BRC destination address 16 (rw) */
    Ifx_Strict_32Bit EN_DEST17:1;           /**< \brief [17:17] Enable BRC destination address 17 (rw) */
    Ifx_Strict_32Bit EN_DEST18:1;           /**< \brief [18:18] Enable BRC destination address 18 (rw) */
    Ifx_Strict_32Bit EN_DEST19:1;           /**< \brief [19:19] Enable BRC destination address 19 (rw) */
    Ifx_Strict_32Bit EN_DEST20:1;           /**< \brief [20:20] Enable BRC destination address 20 (rw) */
    Ifx_Strict_32Bit EN_DEST21:1;           /**< \brief [21:21] Enable BRC destination address 21 (rw) */
    Ifx_Strict_32Bit EN_TRASHBIN:1;         /**< \brief [22:22] Control trash bin functionality (rw) */
    Ifx_Strict_32Bit reserved_23:9;         /**< \brief \internal Reserved */
} Ifx_GTM_BRC_SRC_DEST_Bits;

/** \\brief  GTM to SPB BRIDGE MODE */
typedef struct _Ifx_GTM_BRIDGE_MODE_Bits
{
    Ifx_Strict_32Bit BRG_MODE:1;            /**< \brief [0:0] Defines the operation mode for the AEI bridge (rw) */
    Ifx_Strict_32Bit MSK_WR_RSP:1;          /**< \brief [1:1] Mask write response (rw) */
    Ifx_Strict_32Bit reserved_2:6;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit MODE_UP_PGR:1;         /**< \brief [8:8] Mode update in progress (r) */
    Ifx_Strict_32Bit BUFF_OVL:1;            /**< \brief [9:9] Buffer overflow register (rwh) */
    Ifx_Strict_32Bit reserved_10:6;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit BRG_RST:1;             /**< \brief [16:16] Bridge software reset (w) */
    Ifx_Strict_32Bit reserved_17:7;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit BUFF_DPT:8;            /**< \brief [31:24] Buffer depth of AEI bridge (r) */
} Ifx_GTM_BRIDGE_MODE_Bits;

/** \\brief  GTM to SPB BRIDGE PTR1 */
typedef struct _Ifx_GTM_BRIDGE_PTR1_Bits
{
    Ifx_Strict_32Bit NEW_TRAN_PTR:5;        /**< \brief [4:0] New transaction pointer (r) */
    Ifx_Strict_32Bit FIRST_RSP_PTR:5;       /**< \brief [9:5] First response pointer (r) */
    Ifx_Strict_32Bit TRAN_IN_PGR:5;         /**< \brief [14:10] Transaction in progress pointer (aquire) (r) */
    Ifx_Strict_32Bit ABT_TRAN_PGR:5;        /**< \brief [19:15] Aborted transaction in progress pointer (r) */
    Ifx_Strict_32Bit FBC:6;                 /**< \brief [25:20] Free buffer count (r) */
    Ifx_Strict_32Bit RSP_TRAN_RDY:6;        /**< \brief [31:26] Response transactions ready (r) */
} Ifx_GTM_BRIDGE_PTR1_Bits;

/** \\brief  GTM to SPB BRIDGE PTR2 */
typedef struct _Ifx_GTM_BRIDGE_PTR2_Bits
{
    Ifx_Strict_32Bit TRAN_IN_PGR2:5;        /**< \brief [4:0] Transaction in progress pointer (aquire2) (r) */
    Ifx_Strict_32Bit reserved_5:27;         /**< \brief \internal Reserved */
} Ifx_GTM_BRIDGE_PTR2_Bits;

/** \\brief  Clock Control Register */
typedef struct _Ifx_GTM_CLC_Bits
{
    Ifx_Strict_32Bit DISR:1;                /**< \brief [0:0] Module Disable Request Bit (rw) */
    Ifx_Strict_32Bit DISS:1;                /**< \brief [1:1] Module Disable Status Bit (r) */
    Ifx_Strict_32Bit reserved_2:1;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit EDIS:1;                /**< \brief [3:3] Sleep Mode Enable Control (rw) */
    Ifx_Strict_32Bit reserved_4:28;         /**< \brief \internal Reserved */
} Ifx_GTM_CLC_Bits;

/** \\brief  CMP Comparator Enable Register */
typedef struct _Ifx_GTM_CMP_EN_Bits
{
    Ifx_Strict_32Bit ABWC0_EN:1;            /**< \brief [0:0] Enable comparator 0 in ABWC (rw) */
    Ifx_Strict_32Bit ABWC1_EN:1;            /**< \brief [1:1] Enable comparator 1 in ABWC (rw) */
    Ifx_Strict_32Bit ABWC2_EN:1;            /**< \brief [2:2] Enable comparator 2 in ABWC (rw) */
    Ifx_Strict_32Bit ABWC3_EN:1;            /**< \brief [3:3] Enable comparator 3 in ABWC (rw) */
    Ifx_Strict_32Bit ABWC4_EN:1;            /**< \brief [4:4] Enable comparator 4 in ABWC (rw) */
    Ifx_Strict_32Bit ABWC5_EN:1;            /**< \brief [5:5] Enable comparator 5 in ABWC (rw) */
    Ifx_Strict_32Bit ABWC6_EN:1;            /**< \brief [6:6] Enable comparator 6 in ABWC (rw) */
    Ifx_Strict_32Bit ABWC7_EN:1;            /**< \brief [7:7] Enable comparator 7 in ABWC (rw) */
    Ifx_Strict_32Bit ABWC8_EN:1;            /**< \brief [8:8] Enable comparator 8 in ABWC (rw) */
    Ifx_Strict_32Bit ABWC9_EN:1;            /**< \brief [9:9] Enable comparator 9 in ABW (rw) */
    Ifx_Strict_32Bit ABWC10_EN:1;           /**< \brief [10:10] Enable comparator 10 in ABWC (rw) */
    Ifx_Strict_32Bit ABWC11_EN:1;           /**< \brief [11:11] Enable comparator 11 in ABWC (rw) */
    Ifx_Strict_32Bit TBWC0_EN:1;            /**< \brief [12:12] Enable comparator 0 in TBWC (rw) */
    Ifx_Strict_32Bit TBWC1_EN:1;            /**< \brief [13:13] Enable comparator 1 in TBWC (rw) */
    Ifx_Strict_32Bit TBWC2_EN:1;            /**< \brief [14:14] Enable comparator 2 in TBWC (rw) */
    Ifx_Strict_32Bit TBWC3_EN:1;            /**< \brief [15:15] Enable comparator 3 in TBWC (rw) */
    Ifx_Strict_32Bit TBWC4_EN:1;            /**< \brief [16:16] Enable comparator 4 in TBWC (rw) */
    Ifx_Strict_32Bit TBWC5_EN:1;            /**< \brief [17:17] Enable comparator 5 in TBWC (rw) */
    Ifx_Strict_32Bit TBWC6_EN:1;            /**< \brief [18:18] Enable comparator 6 in TBWC (rw) */
    Ifx_Strict_32Bit TBWC7_EN:1;            /**< \brief [19:19] Enable comparator 7 in TBWC (rw) */
    Ifx_Strict_32Bit TBWC8_EN:1;            /**< \brief [20:20] Enable comparator 8 in TBWC (rw) */
    Ifx_Strict_32Bit TBWC9_EN:1;            /**< \brief [21:21] Enable comparator 9 in TBWC (rw) */
    Ifx_Strict_32Bit TBWC10_EN:1;           /**< \brief [22:22] Enable comparator 10 in TBWC (rw) */
    Ifx_Strict_32Bit TBWC11_EN:1;           /**< \brief [23:23] Enable comparator 11 in TBWC (rw) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_GTM_CMP_EN_Bits;

