HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxGtm_regdef.h
/** \\brief  CMP IRQ Mode Configuration Register */
typedef struct _Ifx_GTM_CMP_IRQ_MODE_Bits
{
    Ifx_Strict_32Bit IRQ_MODE:2;            /**< \brief [1:0] IRQ mode selection (rw) */
    Ifx_Strict_32Bit reserved_2:30;         /**< \brief \internal Reserved */
} Ifx_GTM_CMP_IRQ_MODE_Bits;

/** \\brief  CMP Event Notification Register */
typedef struct _Ifx_GTM_CMP_IRQ_NOTIFY_Bits
{
    Ifx_Strict_32Bit ABWC0:1;               /**< \brief [0:0] ATOM sub modules outputs bitwise comparator 0 error indication (rwh) */
    Ifx_Strict_32Bit ABWC1:1;               /**< \brief [1:1] ATOM sub modules outputs bitwise comparator 1 error indication (rwh) */
    Ifx_Strict_32Bit ABWC2:1;               /**< \brief [2:2] ATOM sub modules outputs bitwise comparator 2 error indication (rwh) */
    Ifx_Strict_32Bit ABWC3:1;               /**< \brief [3:3] ATOM sub modules outputs bitwise comparator 3 error indication (rwh) */
    Ifx_Strict_32Bit ABWC4:1;               /**< \brief [4:4] ATOM sub modules outputs bitwise comparator 4 error indication (rwh) */
    Ifx_Strict_32Bit ABWC5:1;               /**< \brief [5:5] ATOM sub modules outputs bitwise comparator 5 error indication (rwh) */
    Ifx_Strict_32Bit ABWC6:1;               /**< \brief [6:6] ATOM sub modules outputs bitwise comparator 6 error indication (rwh) */
    Ifx_Strict_32Bit ABWC7:1;               /**< \brief [7:7] ATOM sub modules outputs bitwise comparator 7 error indication (rwh) */
    Ifx_Strict_32Bit ABWC8:1;               /**< \brief [8:8] ATOM sub modules outputs bitwise comparator 8 error indication (rwh) */
    Ifx_Strict_32Bit ABWC9:1;               /**< \brief [9:9] ATOM sub modules outputs bitwise comparator 9 error indication (rwh) */
    Ifx_Strict_32Bit ABWC10:1;              /**< \brief [10:10] ATOM sub modules outputs bitwise comparator 10 error indication (rwh) */
    Ifx_Strict_32Bit ABWC11:1;              /**< \brief [11:11] ATOM sub modules outputs bitwise comparator 11 error indication (rwh) */
    Ifx_Strict_32Bit TBWC0:1;               /**< \brief [12:12] TOM sub modules outputs bitwise comparator 0 error indication (rwh) */
    Ifx_Strict_32Bit TBWC1:1;               /**< \brief [13:13] TOM sub modules outputs bitwise comparator 1 error indication (rwh) */
    Ifx_Strict_32Bit TBWC2:1;               /**< \brief [14:14] TOM sub modules outputs bitwise comparator 2 error indication (rwh) */
    Ifx_Strict_32Bit TBWC3:1;               /**< \brief [15:15] TOM sub modules outputs bitwise comparator 3 error indication (rwh) */
    Ifx_Strict_32Bit TBWC4:1;               /**< \brief [16:16] TOM sub modules outputs bitwise comparator 4 error indication (rwh) */
    Ifx_Strict_32Bit TBWC5:1;               /**< \brief [17:17] TOM sub modules outputs bitwise comparator 5 error indication (rwh) */
    Ifx_Strict_32Bit TBWC6:1;               /**< \brief [18:18] TOM sub modules outputs bitwise comparator 6 error indication (rwh) */
    Ifx_Strict_32Bit TBWC7:1;               /**< \brief [19:19] TOM sub modules outputs bitwise comparator 7 error indication (rwh) */
    Ifx_Strict_32Bit TBWC8:1;               /**< \brief [20:20] TOM sub modules outputs bitwise comparator 8 error indication (rwh) */
    Ifx_Strict_32Bit TBWC9:1;               /**< \brief [21:21] TOM sub modules outputs bitwise comparator 9 error indication (rwh) */
    Ifx_Strict_32Bit TBWC10:1;              /**< \brief [22:22] TOM sub modules outputs bitwise comparator 10 error indication (rwh) */
    Ifx_Strict_32Bit TBWC11:1;              /**< \brief [23:23] TOM sub modules outputs bitwise comparator 11 error indication (rwh) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_GTM_CMP_IRQ_NOTIFY_Bits;

/** \\brief  CMU Control For Clock Source Register */
typedef struct _Ifx_GTM_CMU_CLK0_4_CTRL_Bits
{
    Ifx_Strict_32Bit CLK_CNT:24;            /**< \brief [23:0] Clock count Defines count value for the clock divider of clock source CMU_CLK[x] (x:0...4) (rw) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_GTM_CMU_CLK0_4_CTRL_Bits;

/** \\brief  CMU Control For Clock Source 5 Register */
typedef struct _Ifx_GTM_CMU_CLK_5_CTRL_Bits
{
    Ifx_Strict_32Bit CLK_CNT:24;            /**< \brief [23:0] Clock count Defines count value for the clock divider of clock source CMU_CLK[5] (rw) */
    Ifx_Strict_32Bit reserved_24:7;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit FXCLK_SEL:1;           /**< \brief [31:31] Clock source selection for CMU_FXCLKs (rw) */
} Ifx_GTM_CMU_CLK_5_CTRL_Bits;

/** \\brief  CMU Control For Clock Source 6 Register */
typedef struct _Ifx_GTM_CMU_CLK_6_CTRL_Bits
{
    Ifx_Strict_32Bit CLK_CNT:24;            /**< \brief [23:0] Clock count. Define count value for the clock divider of clock source CMU_CLK6 (rw) */
    Ifx_Strict_32Bit CLK6_SEL:1;            /**< \brief [24:24] Clock source selection for CMU_CLK6 (rw) */
    Ifx_Strict_32Bit reserved_25:7;         /**< \brief \internal Reserved */
} Ifx_GTM_CMU_CLK_6_CTRL_Bits;

/** \\brief  CMU Control For Clock Source 7 Register */
typedef struct _Ifx_GTM_CMU_CLK_7_CTRL_Bits
{
    Ifx_Strict_32Bit CLK_CNT:24;            /**< \brief [23:0] Clock count. Define count value for the clock divider of clock source CMU_CLK7 (rw) */
    Ifx_Strict_32Bit CLK7_SEL:1;            /**< \brief [24:24] Clock source selection for CMU_CLK7 (rw) */
    Ifx_Strict_32Bit reserved_25:7;         /**< \brief \internal Reserved */
} Ifx_GTM_CMU_CLK_7_CTRL_Bits;

/** \\brief  CMU Clock Enable Register */
typedef struct _Ifx_GTM_CMU_CLK_EN_Bits
{
    Ifx_Strict_32Bit EN_CLK0:2;             /**< \brief [1:0] Enable clock source 0 (rw) */
    Ifx_Strict_32Bit EN_CLK1:2;             /**< \brief [3:2] Enable clock source 1 (rw) */
    Ifx_Strict_32Bit EN_CLK2:2;             /**< \brief [5:4] Enable clock source 2 (rw) */
    Ifx_Strict_32Bit EN_CLK3:2;             /**< \brief [7:6] Enable clock source 3 (rw) */
    Ifx_Strict_32Bit EN_CLK4:2;             /**< \brief [9:8] Enable clock source 4 (rw) */
    Ifx_Strict_32Bit EN_CLK5:2;             /**< \brief [11:10] Enable clock source 5 (rw) */
    Ifx_Strict_32Bit EN_CLK6:2;             /**< \brief [13:12] Enable clock source 6 (rw) */
    Ifx_Strict_32Bit EN_CLK7:2;             /**< \brief [15:14] Enable clock source 7 (rw) */
    Ifx_Strict_32Bit EN_ECLK0:2;            /**< \brief [17:16] Enable ECLK 0 generation subunit (rw) */
    Ifx_Strict_32Bit EN_ECLK1:2;            /**< \brief [19:18] Enable ECLK 1 generation subunit (rw) */
    Ifx_Strict_32Bit EN_ECLK2:2;            /**< \brief [21:20] Enable ECLK 2 generation subunit (rw) */
    Ifx_Strict_32Bit EN_FXCLK:2;            /**< \brief [23:22] Enable all CMU_FXCLK (rw) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_GTM_CMU_CLK_EN_Bits;

/** \\brief  CMU External Clock Control Denominator Register */
typedef struct _Ifx_GTM_CMU_ECLK_DEN_Bits
{
    Ifx_Strict_32Bit ECLK_DEN:24;           /**< \brief [23:0] Denominator for external clock divider (rw) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_GTM_CMU_ECLK_DEN_Bits;

/** \\brief  CMU External Clock Control Numerator Register */
typedef struct _Ifx_GTM_CMU_ECLK_NUM_Bits
{
    Ifx_Strict_32Bit ECLK_NUM:24;           /**< \brief [23:0] Numerator for external clock divider (rw) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_GTM_CMU_ECLK_NUM_Bits;

/** \\brief  CMU Global Clock Control Denominator Register */
typedef struct _Ifx_GTM_CMU_GCLK_DEN_Bits
{
    Ifx_Strict_32Bit GCLK_DEN:24;           /**< \brief [23:0] Denominator for global clock divider (rw) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_GTM_CMU_GCLK_DEN_Bits;

