HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxGtm_regdef.h
/** \\brief  CMU Global Clock Control Numerator Register */
typedef struct _Ifx_GTM_CMU_GCLK_NUM_Bits
{
    Ifx_Strict_32Bit GCLK_NUM:24;           /**< \brief [23:0] Numerator for global clock divider (rw) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_GTM_CMU_GCLK_NUM_Bits;

/** \\brief  GTM Global Control Register */
typedef struct _Ifx_GTM_CTRL_Bits
{
    Ifx_Strict_32Bit RF_PROT:1;             /**< \brief [0:0] RST and FORCINT protection (rw) */
    Ifx_Strict_32Bit TO_MODE:1;             /**< \brief [1:1] AEI Timeout mode (rw) */
    Ifx_Strict_32Bit reserved_2:2;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit TO_VAL:5;              /**< \brief [8:4] AEI Timeout value (rw) */
    Ifx_Strict_32Bit reserved_9:23;         /**< \brief \internal Reserved */
} Ifx_GTM_CTRL_Bits;

/** \\brief  Control Bits For Actions Register i */
typedef struct _Ifx_GTM_DPLL_ACB_Bits
{
    Ifx_Strict_32Bit ACBj_0:5;              /**< \brief [4:0] Action Control Bits of ACTION_i (rw) */
    Ifx_Strict_32Bit reserved_5:3;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit ACBj_1:5;              /**< \brief [12:8] Action Control Bits of ACTION_(i + 1), reflects ACT_D[i+1](5248) (rw) */
    Ifx_Strict_32Bit reserved_13:3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit ACBj_2:5;              /**< \brief [20:16] Action Control Bits of ACTION_(i + 2), reflects ACT_D[i+2](5248) (rw) */
    Ifx_Strict_32Bit reserved_21:3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit ACBj_3:5;              /**< \brief [28:24] Action Control Bits of ACTION_(i + 3), reflects ACT_D[i+3](5248) (rw) */
    Ifx_Strict_32Bit reserved_29:3;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_ACB_Bits;

/** \\brief  DPLL ACTION Status Register With Shadow Register */
typedef struct _Ifx_GTM_DPLL_ACT_STA_Bits
{
    Ifx_Strict_32Bit ACT_Ni:24;             /**< \brief [23:0] New output data values concerning to action i provided (rw) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_ACT_STA_Bits;

/** \\brief  DPLL Direct Load Input Value for SUB_INC1 */
typedef struct _Ifx_GTM_DPLL_ADD_IN_LD1_Bits
{
    Ifx_Strict_32Bit ADD_IN_LD_1:24;        /**< \brief [23:0] Input value for SUB_INC1 generation (rw) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_ADD_IN_LD1_Bits;

/** \\brief  DPLL Direct Load Input Value for SUB_INC1 */
typedef struct _Ifx_GTM_DPLL_ADD_IN_LD2_Bits
{
    Ifx_Strict_32Bit ADD_IN_LD_2:24;        /**< \brief [23:0] Input value for SUB_INC2 generation (rw) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_ADD_IN_LD2_Bits;

/** \\brief  DPLL Address Offset Register For APT In RAM Region 2 */
typedef struct _Ifx_GTM_DPLL_AOSV_2_Bits
{
    Ifx_Strict_32Bit AOSV_2a:8;             /**< \brief [7:0] Address offset value of the RAM 2a region (r) */
    Ifx_Strict_32Bit AOSV_2b:8;             /**< \brief [15:8] Address offset value of the RAM 2b region (r) */
    Ifx_Strict_32Bit AOSV_2c:8;             /**< \brief [23:16] Address offset value of the RAM 2c region (r) */
    Ifx_Strict_32Bit AOSV_2d:8;             /**< \brief [31:24] Address offset value of the RAM 2d region (r) */
} Ifx_GTM_DPLL_AOSV_2_Bits;

/** \\brief  DPLL Actual RAM Pointer to RAM Region 1c3 */
typedef struct _Ifx_GTM_DPLL_APS_1c3_Bits
{
    Ifx_Strict_32Bit reserved_0:2;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit APS_1c3:6;             /**< \brief [7:2] Address pointer STATE for RAM region 1c3 (rw) */
    Ifx_Strict_32Bit reserved_8:24;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_APS_1c3_Bits;

/** \\brief  DPLL Actual RAM Pointer to RAM Regions 1c1, 1c2 and 1c4 */
typedef struct _Ifx_GTM_DPLL_APS_Bits
{
    Ifx_Strict_32Bit reserved_0:1;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit WAPS:1;                /**< \brief [1:1] Write bit for address pointer APS (w) */
    Ifx_Strict_32Bit APS:6;                 /**< \brief [7:2] Address pointer STATE (rw) */
    Ifx_Strict_32Bit reserved_8:5;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit WAPS_1c2:1;            /**< \brief [13:13] Write bit for address pointer APS_1c2 (w) */
    Ifx_Strict_32Bit APS_1c2:6;             /**< \brief [19:14] Address pointer STATE for RAM region 1c2 (rw) */
    Ifx_Strict_32Bit reserved_20:12;        /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_APS_Bits;

/** \\brief  DPLL Old RAM Pointer and Offset Value for STATE */
typedef struct _Ifx_GTM_DPLL_APS_SYNC_Bits
{
    Ifx_Strict_32Bit APS_1c2_ext:6;         /**< \brief [5:0] Address pointer 1c2 extension (rw) */
    Ifx_Strict_32Bit APS_1c2_status:1;      /**< \brief [6:6] Address pointer 1c2 status (rwh) */
    Ifx_Strict_32Bit reserved_7:7;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit APS_1c2_old:6;         /**< \brief [19:14] Address pointer STATE for RAM region 1c2 at synchronization time (rw) */
    Ifx_Strict_32Bit reserved_20:12;        /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_APS_SYNC_Bits;

/** \\brief  DPLL Actual RAM Pointer to RAM Region 2c */
typedef struct _Ifx_GTM_DPLL_APT_2c_Bits
{
    Ifx_Strict_32Bit reserved_0:2;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit APT_2c:10;             /**< \brief [11:2] Address pointer TRIGGER for RAM region 2c (rw) */
    Ifx_Strict_32Bit reserved_12:20;        /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_APT_2c_Bits;

/** \\brief  DPLL Actual RAM Pointer to RAM Regions 2a, b and d */
typedef struct _Ifx_GTM_DPLL_APT_Bits
{
    Ifx_Strict_32Bit reserved_0:1;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit WAPT:1;                /**< \brief [1:1] Write bit for address pointer APT (w) */
    Ifx_Strict_32Bit APT:10;                /**< \brief [11:2] Address pointer TRIGGER (rw) */
    Ifx_Strict_32Bit reserved_12:1;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit WAPT_2b:1;             /**< \brief [13:13] Write bit for address pointer APT_2b (w) */
    Ifx_Strict_32Bit APT_2b:10;             /**< \brief [23:14] Address pointer TRIGGER for RAM region 2b (rw) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_APT_Bits;

