HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxGtm_regdef.h
/** \\brief  DPLL Old RAM Pointer and Offset Value for TRIGGER */
typedef struct _Ifx_GTM_DPLL_APT_SYNC_Bits
{
    Ifx_Strict_32Bit APT_2b_ext:6;          /**< \brief [5:0] Address pointer 2b extension (rw) */
    Ifx_Strict_32Bit APT_2b_status:1;       /**< \brief [6:6] Address pointer 2b status (rwh) */
    Ifx_Strict_32Bit reserved_7:7;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit APT_2b_old:10;         /**< \brief [23:14] Address pointer TRIGGER for RAM region 2b at synchronization time (rw) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_APT_SYNC_Bits;

/** \\brief  DPLL Control 1 Shadow STATE Register */
typedef struct _Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits
{
    Ifx_Strict_32Bit DMO:1;                 /**< \brief [0:0] DPLL mode select (r) */
    Ifx_Strict_32Bit DEN:1;                 /**< \brief [1:1] DPLL enable (r) */
    Ifx_Strict_32Bit reserved_2:1;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit COA:1;                 /**< \brief [3:3] Correction strategy in automatic end mode (DMO=0) (r) */
    Ifx_Strict_32Bit PIT:1;                 /**< \brief [4:4] Plausibility (r) */
    Ifx_Strict_32Bit SGE1:1;                /**< \brief [5:5] SUB_INC1 generator enable (r) */
    Ifx_Strict_32Bit DLM1:1;                /**< \brief [6:6] Direct Load Mode (r) */
    Ifx_Strict_32Bit PCM1:1;                /**< \brief [7:7] Pulse Correction Mode (r) */
    Ifx_Strict_32Bit SGE2:1;                /**< \brief [8:8] SUB_INC2 generator enable (r) */
    Ifx_Strict_32Bit DLM2:1;                /**< \brief [9:9] Direct Load Mode (r) */
    Ifx_Strict_32Bit PCM2:1;                /**< \brief [10:10] Pulse Correction Mode (r) */
    Ifx_Strict_32Bit SYN_NS:5;              /**< \brief [15:11] Synchronization number of STATE (r) */
    Ifx_Strict_32Bit SYN_NT:5;              /**< \brief [20:16] Synchronization number of TRIGGER (r) */
    Ifx_Strict_32Bit reserved_21:2;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SWR:1;                 /**< \brief [23:23] Software Reset (r) */
    Ifx_Strict_32Bit SYSF:1;                /**< \brief [24:24] SYN_NS for FULL_SCALE (r) */
    Ifx_Strict_32Bit TS0_HRS:1;             /**< \brief [25:25] Time stamp high resolution STATE (r) */
    Ifx_Strict_32Bit TS0_HRT:1;             /**< \brief [26:26] Time stamp high resolution TRIGGER (r) */
    Ifx_Strict_32Bit SMC:1;                 /**< \brief [27:27] Synchronous Motor Control (r) */
    Ifx_Strict_32Bit SSL:2;                 /**< \brief [29:28] STATE slope select (r) */
    Ifx_Strict_32Bit TSL:2;                 /**< \brief [31:30] TRIGGER slope selected (r) */
} Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE_Bits;

/** \\brief  DPLL Control Register 0 */
typedef struct _Ifx_GTM_DPLL_CTRL_0_Bits
{
    Ifx_Strict_32Bit MLT:10;                /**< \brief [9:0] Multiplier for TRIGGER (rw) */
    Ifx_Strict_32Bit IFP:1;                 /**< \brief [10:10] Input filter position (rw) */
    Ifx_Strict_32Bit SNU:5;                 /**< \brief [15:11] STATE number (rw) */
    Ifx_Strict_32Bit TNU:9;                 /**< \brief [24:16] TRIGGER number (rw) */
    Ifx_Strict_32Bit AMS:1;                 /**< \brief [25:25] Adapt mode STATE (rw) */
    Ifx_Strict_32Bit AMT:1;                 /**< \brief [26:26] Adapt mode TRIGGER (rw) */
    Ifx_Strict_32Bit IDS:1;                 /**< \brief [27:27] Input delay STATE (rw) */
    Ifx_Strict_32Bit IDT:1;                 /**< \brief [28:28] Input delay TRIGGER (rw) */
    Ifx_Strict_32Bit SEN:1;                 /**< \brief [29:29] STATE enable (rw) */
    Ifx_Strict_32Bit TEN:1;                 /**< \brief [30:30] TRIGGER enable (rw) */
    Ifx_Strict_32Bit RMO:1;                 /**< \brief [31:31] Reference mode (rw) */
} Ifx_GTM_DPLL_CTRL_0_Bits;

/** \\brief  DPLL Control 0 Shadow STATE Register */
typedef struct _Ifx_GTM_DPLL_CTRL_0_SHADOW_STATE_Bits
{
    Ifx_Strict_32Bit MLT:10;                /**< \brief [9:0] Multipler for TRIGGER (r) */
    Ifx_Strict_32Bit IFP:1;                 /**< \brief [10:10] Input filter position (r) */
    Ifx_Strict_32Bit SNU:5;                 /**< \brief [15:11] STATE number (r) */
    Ifx_Strict_32Bit TNU:9;                 /**< \brief [24:16] TRIGGER number (r) */
    Ifx_Strict_32Bit AMS:1;                 /**< \brief [25:25] Adapt mode STATE (r) */
    Ifx_Strict_32Bit AMT:1;                 /**< \brief [26:26] Adapt mode TRIGGER (r) */
    Ifx_Strict_32Bit IDS:1;                 /**< \brief [27:27] Input delay STATE (r) */
    Ifx_Strict_32Bit IDT:1;                 /**< \brief [28:28] Input delay TRIGGER (r) */
    Ifx_Strict_32Bit SEN:1;                 /**< \brief [29:29] STATE enable (r) */
    Ifx_Strict_32Bit TEN:1;                 /**< \brief [30:30] TRIGGER enable (r) */
    Ifx_Strict_32Bit RMO:1;                 /**< \brief [31:31] Reference mode; selection of the relevant the input signal for generation of SUB_INC1 (r) */
} Ifx_GTM_DPLL_CTRL_0_SHADOW_STATE_Bits;

/** \\brief  DPLL Control0 Shadow Trigger Register */
typedef struct _Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_Bits
{
    Ifx_Strict_32Bit MLT:10;                /**< \brief [9:0] multipler for TRIGGER (r) */
    Ifx_Strict_32Bit IFP:1;                 /**< \brief [10:10] Input filter position (r) */
    Ifx_Strict_32Bit SNU:5;                 /**< \brief [15:11] STATE number (r) */
    Ifx_Strict_32Bit TNU:9;                 /**< \brief [24:16] TRIGGER number (r) */
    Ifx_Strict_32Bit AMS:1;                 /**< \brief [25:25] Adapt mode STATE (r) */
    Ifx_Strict_32Bit AMT:1;                 /**< \brief [26:26] Adapt mode TRIGGER (r) */
    Ifx_Strict_32Bit IDS:1;                 /**< \brief [27:27] Input delay STATE (r) */
    Ifx_Strict_32Bit IDT:1;                 /**< \brief [28:28] Input delay TRIGGER (r) */
    Ifx_Strict_32Bit SEN:1;                 /**< \brief [29:29] STATE enable (r) */
    Ifx_Strict_32Bit TEN:1;                 /**< \brief [30:30] TRIGGER enable (r) */
    Ifx_Strict_32Bit RMO:1;                 /**< \brief [31:31] Reference mode (r) */
} Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER_Bits;

/** \\brief  DPLL Control Register 1 */
typedef struct _Ifx_GTM_DPLL_CTRL_1_Bits
{
    Ifx_Strict_32Bit DMO:1;                 /**< \brief [0:0] DPLL mode select (rw) */
    Ifx_Strict_32Bit DEN:1;                 /**< \brief [1:1] DPLL enable (rw) */
    Ifx_Strict_32Bit reserved_2:1;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit COA:1;                 /**< \brief [3:3] Correction strategy in automatic end mode (DMO=0) (rw) */
    Ifx_Strict_32Bit PIT:1;                 /**< \brief [4:4] Plausibility value PVT to next valid TRIGGER is time related (rw) */
    Ifx_Strict_32Bit SGE1:1;                /**< \brief [5:5] SUB_INC1 generator enable (rw) */
    Ifx_Strict_32Bit DLM1:1;                /**< \brief [6:6] Direct Load Mode for SUB_INC1 generation (rw) */
    Ifx_Strict_32Bit PCM1:1;                /**< \brief [7:7] Pulse Correction Mode for SUB_INC1 generation (rw) */
    Ifx_Strict_32Bit SGE2:1;                /**< \brief [8:8] SUB_INC2 generator enable (rw) */
    Ifx_Strict_32Bit DLM2:1;                /**< \brief [9:9] Direct Load Mode for SUB_INC2 generation (rw) */
    Ifx_Strict_32Bit PCM2:1;                /**< \brief [10:10] Pulse Correction Mode for SUB_INC2 generation (rw) */
    Ifx_Strict_32Bit SYN_NS:5;              /**< \brief [15:11] Synchronization number of STATE (rw) */
    Ifx_Strict_32Bit SYN_NT:5;              /**< \brief [20:16] Synchronization number of TRIGGER (rw) */
    Ifx_Strict_32Bit reserved_21:2;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SWR:1;                 /**< \brief [23:23] Software Reset (w) */
    Ifx_Strict_32Bit SYSF:1;                /**< \brief [24:24] SYN_NS for FULL_SCALE (rw) */
    Ifx_Strict_32Bit TS0_HRS:1;             /**< \brief [25:25] TS0_HRS (rw) */
    Ifx_Strict_32Bit TS0_HRT:1;             /**< \brief [26:26] TS0_HRT (rw) */
    Ifx_Strict_32Bit SMC:1;                 /**< \brief [27:27] Synchronous Motor Control (rw) */
    Ifx_Strict_32Bit SSL:2;                 /**< \brief [29:28] STATE slope select (rw) */
    Ifx_Strict_32Bit TSL:2;                 /**< \brief [31:30] Definition of active slope for signal TRIGGER each active slope is an event defined by TNU (rw) */
} Ifx_GTM_DPLL_CTRL_1_Bits;

/** \\brief  DPLL Control 1 Shadow TRIGGER Register */
typedef struct _Ifx_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_Bits
{
    Ifx_Strict_32Bit DMO:1;                 /**< \brief [0:0] DPLL mode select (r) */
    Ifx_Strict_32Bit DEN:1;                 /**< \brief [1:1] DPLL enable (r) */
    Ifx_Strict_32Bit reserved_2:1;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit COA:1;                 /**< \brief [3:3] Correction strategy in automatic end mode (DMO=0) (r) */
    Ifx_Strict_32Bit PIT:1;                 /**< \brief [4:4] Plausibility (r) */
    Ifx_Strict_32Bit SGE1:1;                /**< \brief [5:5] SUB_INC1 generator enable (r) */
    Ifx_Strict_32Bit DLM1:1;                /**< \brief [6:6] Direct Load Mode (r) */
    Ifx_Strict_32Bit PCM1:1;                /**< \brief [7:7] Pulse Correction Mode (r) */
    Ifx_Strict_32Bit SGE2:1;                /**< \brief [8:8] SUB_INC2 generator enable (r) */
    Ifx_Strict_32Bit DLM2:1;                /**< \brief [9:9] Direct Load Mode (r) */
    Ifx_Strict_32Bit PCM2:1;                /**< \brief [10:10] Pulse Correction Mode (r) */
    Ifx_Strict_32Bit SYN_NS:5;              /**< \brief [15:11] Synchronization number of STATE (r) */
    Ifx_Strict_32Bit SYN_NT:5;              /**< \brief [20:16] Synchronization number of TRIGGER (r) */
    Ifx_Strict_32Bit reserved_21:2;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SWR:1;                 /**< \brief [23:23] Software Reset (r) */
    Ifx_Strict_32Bit SYSF:1;                /**< \brief [24:24] SYN_NS for FULL_SCALE (r) */
    Ifx_Strict_32Bit TS0_HRS:1;             /**< \brief [25:25] Time stamp high resolution STATE (r) */
    Ifx_Strict_32Bit TS0_HRT:1;             /**< \brief [26:26] Time stamp high resolution TRIGGER (r) */
    Ifx_Strict_32Bit SMC:1;                 /**< \brief [27:27] Synchronous Motor Control (r) */
    Ifx_Strict_32Bit SSL:2;                 /**< \brief [29:28] STATE slope select (r) */
    Ifx_Strict_32Bit TSL:2;                 /**< \brief [31:30] TRIGGER slope selected (r) */
} Ifx_GTM_DPLL_CTRL_1_SHADOW_TRIGGER_Bits;

/** \\brief  DPLL Control Register 2 */
typedef struct _Ifx_GTM_DPLL_CTRL_2_Bits
{
    Ifx_Strict_32Bit reserved_0:8;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit AEN0:1;                /**< \brief [8:8] ACTION_0 enable (rw) */
    Ifx_Strict_32Bit AEN1:1;                /**< \brief [9:9] ACTION_1 enable (rw) */
    Ifx_Strict_32Bit AEN2:1;                /**< \brief [10:10] ACTION_2 enable (rw) */
    Ifx_Strict_32Bit AEN3:1;                /**< \brief [11:11] ACTION_3 enable (rw) */
    Ifx_Strict_32Bit AEN4:1;                /**< \brief [12:12] ACTION_4 enable (rw) */
    Ifx_Strict_32Bit AEN5:1;                /**< \brief [13:13] ACTION_5 enable (rw) */
    Ifx_Strict_32Bit AEN6:1;                /**< \brief [14:14] ACTION_6 enable (rw) */
    Ifx_Strict_32Bit AEN7:1;                /**< \brief [15:15] ACTION_7 enable (rw) */
    Ifx_Strict_32Bit WAD0:1;                /**< \brief [16:16] Write control bit of Action_0 (w) */
    Ifx_Strict_32Bit WAD1:1;                /**< \brief [17:17] Write control bit of Action_1 (w) */
    Ifx_Strict_32Bit WAD2:1;                /**< \brief [18:18] Write control bit of Action_2 (w) */
    Ifx_Strict_32Bit WAD3:1;                /**< \brief [19:19] Write control bit of Action_3 (w) */
    Ifx_Strict_32Bit WAD4:1;                /**< \brief [20:20] Write control bit of Action_4 (w) */
    Ifx_Strict_32Bit WAD5:1;                /**< \brief [21:21] Write control bit of Action_5 (w) */
    Ifx_Strict_32Bit WAD6:1;                /**< \brief [22:22] Write control bit of Action_6 (w) */
    Ifx_Strict_32Bit WAD7:1;                /**< \brief [23:23] Write control bit of Action_7 (w) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_CTRL_2_Bits;

