HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxGtm_regdef.h
/** \\brief  DPLL Control Register 3 */
typedef struct _Ifx_GTM_DPLL_CTRL_3_Bits
{
    Ifx_Strict_32Bit reserved_0:8;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit AEN8:1;                /**< \brief [8:8] ACTION_8 enable (rw) */
    Ifx_Strict_32Bit AEN9:1;                /**< \brief [9:9] ACTION_9 enable (rw) */
    Ifx_Strict_32Bit AEN10:1;               /**< \brief [10:10] ACTION_10enable (rw) */
    Ifx_Strict_32Bit AEN11:1;               /**< \brief [11:11] ACTION_11 enable (rw) */
    Ifx_Strict_32Bit AEN12:1;               /**< \brief [12:12] ACTION_12 enable (rw) */
    Ifx_Strict_32Bit AEN13:1;               /**< \brief [13:13] ACTION_13 enable (rw) */
    Ifx_Strict_32Bit AEN14:1;               /**< \brief [14:14] ACTION_14 enable (rw) */
    Ifx_Strict_32Bit AEN15:1;               /**< \brief [15:15] ACTION_15 enable (rw) */
    Ifx_Strict_32Bit WAD8:1;                /**< \brief [16:16] Write control bit of Action_8 (w) */
    Ifx_Strict_32Bit WAD9:1;                /**< \brief [17:17] Write control bit of Action_9 (w) */
    Ifx_Strict_32Bit WAD10:1;               /**< \brief [18:18] Write control bit of Action_10 (w) */
    Ifx_Strict_32Bit WAD11:1;               /**< \brief [19:19] Write control bit of Action_11 (w) */
    Ifx_Strict_32Bit WAD12:1;               /**< \brief [20:20] Write control bit of Action_12 (w) */
    Ifx_Strict_32Bit WAD13:1;               /**< \brief [21:21] Write control bit of Action_13 (w) */
    Ifx_Strict_32Bit WAD14:1;               /**< \brief [22:22] Write control bit of Action_14 (w) */
    Ifx_Strict_32Bit WAD15:1;               /**< \brief [23:23] Write control bit of Action_15 (w) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_CTRL_3_Bits;

/** \\brief  DPLL Control Register 4 */
typedef struct _Ifx_GTM_DPLL_CTRL_4_Bits
{
    Ifx_Strict_32Bit reserved_0:8;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit AEN16:1;               /**< \brief [8:8] ACTION_16 enable (rw) */
    Ifx_Strict_32Bit AEN17:1;               /**< \brief [9:9] ACTION_17 enable (rw) */
    Ifx_Strict_32Bit AEN18:1;               /**< \brief [10:10] ACTION_18 enable (rw) */
    Ifx_Strict_32Bit AEN19:1;               /**< \brief [11:11] ACTION_19 enable (rw) */
    Ifx_Strict_32Bit AEN20:1;               /**< \brief [12:12] ACTION_20 enable (rw) */
    Ifx_Strict_32Bit AEN21:1;               /**< \brief [13:13] ACTION_21 enable (rw) */
    Ifx_Strict_32Bit AEN22:1;               /**< \brief [14:14] ACTION_22 enable (rw) */
    Ifx_Strict_32Bit AEN23:1;               /**< \brief [15:15] ACTION_23 enable (rw) */
    Ifx_Strict_32Bit WAD16:1;               /**< \brief [16:16] Write control bit of Action_16 (w) */
    Ifx_Strict_32Bit WAD17:1;               /**< \brief [17:17] Write control bit of Action_17 (w) */
    Ifx_Strict_32Bit WAD18:1;               /**< \brief [18:18] Write control bit of Action_18 (w) */
    Ifx_Strict_32Bit WAD19:1;               /**< \brief [19:19] Write control bit of Action_19 (w) */
    Ifx_Strict_32Bit WAD20:1;               /**< \brief [20:20] Write control bit of Action_20 (w) */
    Ifx_Strict_32Bit WAD21:1;               /**< \brief [21:21] Write control bit of Action_21 (w) */
    Ifx_Strict_32Bit WAD22:1;               /**< \brief [22:22] Write control bit of Action_22 (w) */
    Ifx_Strict_32Bit WAD23:1;               /**< \brief [23:23] Write control bit of Action_23 (w) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_CTRL_4_Bits;

/** \\brief  DPLL ID Information For Input Signal PMTR Register */
typedef struct _Ifx_GTM_DPLL_ID_PMTR_Bits
{
    Ifx_Strict_32Bit ID_PMTR_x:9;           /**< \brief [8:0] ID information to the input signal PMTR_x from the ARU (rw) */
    Ifx_Strict_32Bit reserved_9:23;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_ID_PMTR_Bits;

/** \\brief  DPLL Counter for Pulses for TBU_TS1 to be sent in Automatic End
 * Mode */
typedef struct _Ifx_GTM_DPLL_INC_CNT1_Bits
{
    Ifx_Strict_32Bit INC_CNT1:24;           /**< \brief [23:0] Actual number of pulses to be still sent out at the current increment until the next valid input signal in automatic end mode (rw) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_INC_CNT1_Bits;

/** \\brief  DPLL Counter for Pulses for TBU_TS2 to be sent in Automatic End
 * Mode when SMC=RMO=1 */
typedef struct _Ifx_GTM_DPLL_INC_CNT2_Bits
{
    Ifx_Strict_32Bit INC_CNT2:24;           /**< \brief [23:0] Actual number of pulses to be still sent out at the current increment until the next valid input signal in automatic end mode (rw) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_INC_CNT2_Bits;

/** \\brief  DPLL Interrupt Enable Register */
typedef struct _Ifx_GTM_DPLL_IRQ_EN_Bits
{
    Ifx_Strict_32Bit PDI_IRQ_EN:1;          /**< \brief [0:0] DPLL disable interrupt enable, when switch off of the DEN bit (rw) */
    Ifx_Strict_32Bit PEI_IRQ_EN:1;          /**< \brief [1:1] DPLL enable interrupt enable, when switch on of the DEN bit (rw) */
    Ifx_Strict_32Bit TINI_IRQ_EN:1;         /**< \brief [2:2] TRIGGER minimum hold time violation interrupt enable bit (rw) */
    Ifx_Strict_32Bit TAXI_IRQ_EN:1;         /**< \brief [3:3] TRIGGER maximum hold time violation interrupt enable bit (rw) */
    Ifx_Strict_32Bit SISI_IRQ_EN:1;         /**< \brief [4:4] STATE inactive slope interrupt enable bit (rw) */
    Ifx_Strict_32Bit TISI_IRQ_EN:1;         /**< \brief [5:5] TRIGGER inactive slope interrupt enable bit (rw) */
    Ifx_Strict_32Bit MSI_IRQ_EN:1;          /**< \brief [6:6] Missing STATE interrupt enable (rw) */
    Ifx_Strict_32Bit MTI_IRQ_EN:1;          /**< \brief [7:7] Missing TRIGGER interrupt enable (rw) */
    Ifx_Strict_32Bit SASI_IRQ_EN:1;         /**< \brief [8:8] STATE active slope interrupt enable (rw) */
    Ifx_Strict_32Bit TASI_IRQ_EN:1;         /**< \brief [9:9] TRIGGER active slope interrupt enable (rw) */
    Ifx_Strict_32Bit PWI_IRQ_EN:1;          /**< \brief [10:10] Plausibility window (PVT) violation interrupt of TRIGGER enable (rw) */
    Ifx_Strict_32Bit W2I_IRQ_EN:1;          /**< \brief [11:11] RAM write access to RAM region 2 interrupt enable (rw) */
    Ifx_Strict_32Bit W1I_IRQ_EN:1;          /**< \brief [12:12] Write access to RAM region 1b or 1c interrupt (rw) */
    Ifx_Strict_32Bit GL1I_IRQ_EN:1;         /**< \brief [13:13] Get of lock interrupt enable, when lock arises (rw) */
    Ifx_Strict_32Bit LL1I_IRQ_EN:1;         /**< \brief [14:14] Lost of lock interrupt enable (rw) */
    Ifx_Strict_32Bit EI_IRQ_EN:1;           /**< \brief [15:15] Error interrupt enable (see status register) (rw) */
    Ifx_Strict_32Bit GL2I_IRQ_EN:1;         /**< \brief [16:16] Get of lock interrupt enable for SUB_INC2 (rw) */
    Ifx_Strict_32Bit LL2I_IRQ_EN:1;         /**< \brief [17:17] Lost of lock interrupt enable for SUB_INC2 (rw) */
    Ifx_Strict_32Bit TE0I_IRQ_EN:1;         /**< \brief [18:18] TRIGGER event interrupt 0 enable (rw) */
    Ifx_Strict_32Bit TE1I_IRQ_EN:1;         /**< \brief [19:19] TRIGGER event interrupt 1 enable (rw) */
    Ifx_Strict_32Bit TE2I_IRQ_EN:1;         /**< \brief [20:20] TRIGGER event interrupt 2 enable (rw) */
    Ifx_Strict_32Bit TE3I_IRQ_EN:1;         /**< \brief [21:21] TRIGGER event interrupt 3 enable (rw) */
    Ifx_Strict_32Bit TE4I_IRQ_EN:1;         /**< \brief [22:22] TRIGGER event interrupt 4 enable (rw) */
    Ifx_Strict_32Bit CDTI_IRQ_EN:1;         /**< \brief [23:23] Enable interrupt when calculation of TRIGGER duration done (rw) */
    Ifx_Strict_32Bit CDSI_IRQ_EN:1;         /**< \brief [24:24] Enable interrupt when calculation of TRIGGER duration done (rw) */
    Ifx_Strict_32Bit TORI:1;                /**< \brief [25:25] TRIGGER out of range interrupt (rw) */
    Ifx_Strict_32Bit SORI:1;                /**< \brief [26:26] STATE out of range (rw) */
    Ifx_Strict_32Bit DCGI:1;                /**< \brief [27:27] Direction change interrupt (rw) */
    Ifx_Strict_32Bit reserved_28:4;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_IRQ_EN_Bits;

/** \\brief  DPLL Interrupt Force Register */
typedef struct _Ifx_GTM_DPLL_IRQ_FORCINT_Bits
{
    Ifx_Strict_32Bit TRG_PDI:1;             /**< \brief [0:0] Force Interrupt PDI (w) */
    Ifx_Strict_32Bit TRG_PEI:1;             /**< \brief [1:1] Force Interrupt PEI (w) */
    Ifx_Strict_32Bit TRG_TINI:1;            /**< \brief [2:2] Force Interrupt TINI (w) */
    Ifx_Strict_32Bit TRG_TAXI:1;            /**< \brief [3:3] Force Interrupt TAXI (w) */
    Ifx_Strict_32Bit TRG_SISI:1;            /**< \brief [4:4] Force Interrupt SISI (w) */
    Ifx_Strict_32Bit TRG_TISI:1;            /**< \brief [5:5] Force Interrupt TISI (w) */
    Ifx_Strict_32Bit TRG_MSI:1;             /**< \brief [6:6] Force Interrupt MSI (w) */
    Ifx_Strict_32Bit TRG_MTI:1;             /**< \brief [7:7] Force Interrupt MTI (w) */
    Ifx_Strict_32Bit TRG_SASI:1;            /**< \brief [8:8] Force Interrupt SASI (w) */
    Ifx_Strict_32Bit TRG_TASI:1;            /**< \brief [9:9] Force Interrupt TASI (w) */
    Ifx_Strict_32Bit TRG_PWI:1;             /**< \brief [10:10] Force Interrupt PWI (w) */
    Ifx_Strict_32Bit TRG_W2I:1;             /**< \brief [11:11] Force Interrupt W2IF (w) */
    Ifx_Strict_32Bit TRG_W1I:1;             /**< \brief [12:12] Force Interrupt W1I (w) */
    Ifx_Strict_32Bit TRG_GL1I:1;            /**< \brief [13:13] Force Interrupt GL1I (w) */
    Ifx_Strict_32Bit TRG_LL1I:1;            /**< \brief [14:14] Force Interrupt LL1I (w) */
    Ifx_Strict_32Bit TRG_EI:1;              /**< \brief [15:15] Force Interrupt EI (w) */
    Ifx_Strict_32Bit TRG_GL2I:1;            /**< \brief [16:16] Force Interrupt GL2I (w) */
    Ifx_Strict_32Bit TRG_LL2I:1;            /**< \brief [17:17] Force Interrupt LL2I (w) */
    Ifx_Strict_32Bit TRG_TE0I:1;            /**< \brief [18:18] Force Interrupt TE0I (w) */
    Ifx_Strict_32Bit TRG_TE1I:1;            /**< \brief [19:19] Force Interrupt TE1I (w) */
    Ifx_Strict_32Bit TRG_TE2I:1;            /**< \brief [20:20] Force Interrupt TE2I (w) */
    Ifx_Strict_32Bit TRG_TE3I:1;            /**< \brief [21:21] Force Interrupt TE3I (w) */
    Ifx_Strict_32Bit TRG_TE4I:1;            /**< \brief [22:22] Force Interrupt TE4I (w) */
    Ifx_Strict_32Bit TRG_CDTI:1;            /**< \brief [23:23] Force Interrupt CDTI (w) */
    Ifx_Strict_32Bit TRG_CDSI:1;            /**< \brief [24:24] Force Interrupt CDSI (w) */
    Ifx_Strict_32Bit TRG_TORI:1;            /**< \brief [25:25] Force Interrupt TORI (w) */
    Ifx_Strict_32Bit TRG_SORI:1;            /**< \brief [26:26] Force Interrupt SORI (w) */
    Ifx_Strict_32Bit reserved_27:5;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_IRQ_FORCINT_Bits;

/** \\brief  DPLL Interrupt Mode Register */
typedef struct _Ifx_GTM_DPLL_IRQ_MODE_Bits
{
    Ifx_Strict_32Bit IRQ_MODE:2;            /**< \brief [1:0] IRQ mode selection (rw) */
    Ifx_Strict_32Bit reserved_2:30;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_IRQ_MODE_Bits;

/** \\brief  DPLL Interrupt Notification Register */
typedef struct _Ifx_GTM_DPLL_IRQ_NOTIFY_Bits
{
    Ifx_Strict_32Bit PDI:1;                 /**< \brief [0:0] DPLL disable interrupt (rwh) */
    Ifx_Strict_32Bit PEI:1;                 /**< \brief [1:1] DPLL enable interrupt (rwh) */
    Ifx_Strict_32Bit TINI:1;                /**< \brief [2:2] TRIGGER minimum hold time violation interrupt (∆T) (rwh) */
    Ifx_Strict_32Bit TAXI:1;                /**< \brief [3:3] TRIGGER maximum hold time violation interrupt (∆T>THMA>0) (rwh) */
    Ifx_Strict_32Bit SISI:1;                /**< \brief [4:4] STATE inactive slope interrupt (rwh) */
    Ifx_Strict_32Bit TISI:1;                /**< \brief [5:5] TRIGGER inactive slope interrupt (rwh) */
    Ifx_Strict_32Bit MSI:1;                 /**< \brief [6:6] Missing STATE interrupt (rwh) */
    Ifx_Strict_32Bit MTI:1;                 /**< \brief [7:7] Missing TRIGGER interrupt (rwh) */
    Ifx_Strict_32Bit SASI:1;                /**< \brief [8:8] STATE active slope interrupt (rwh) */
    Ifx_Strict_32Bit TASI:1;                /**< \brief [9:9] TRIGGER active slope interrupt (rwh) */
    Ifx_Strict_32Bit PWI:1;                 /**< \brief [10:10] Plausibility window (PVT) violation interrupt of TRIGGER (rwh) */
    Ifx_Strict_32Bit W2I:1;                 /**< \brief [11:11] RAM write access to RAM region 2 interrupt (rwh) */
    Ifx_Strict_32Bit W1I:1;                 /**< \brief [12:12] Write access to RAM region 1b or 1c interrupt (rwh) */
    Ifx_Strict_32Bit GL1I:1;                /**< \brief [13:13] Get of lock interrupt, for SUB_INC1 (rwh) */
    Ifx_Strict_32Bit LL1I:1;                /**< \brief [14:14] Lost of lock interrupt for SUB_INC1 (rwh) */
    Ifx_Strict_32Bit EI:1;                  /**< \brief [15:15] Error interrupt (see status register bit 31) (rwh) */
    Ifx_Strict_32Bit GL2I:1;                /**< \brief [16:16] Get of lock interrupt, for SUB_INC2 (rwh) */
    Ifx_Strict_32Bit LL2I:1;                /**< \brief [17:17] Lost of lock interrupt for SUB_INC2 (rwh) */
    Ifx_Strict_32Bit TE0I:1;                /**< \brief [18:18] TRIGGER event interrupt 0 (rwh) */
    Ifx_Strict_32Bit TE1I:1;                /**< \brief [19:19] TRIGGER event interrupt 1 (rwh) */
    Ifx_Strict_32Bit TE2I:1;                /**< \brief [20:20] TRIGGER event interrupt 2 (rwh) */
    Ifx_Strict_32Bit TE3I:1;                /**< \brief [21:21] TRIGGER event interrupt 3 (rwh) */
    Ifx_Strict_32Bit TE4I:1;                /**< \brief [22:22] TRIGGER event interrupt 4 (rwh) */
    Ifx_Strict_32Bit CDTI:1;                /**< \brief [23:23] Calculation of TRIGGER duration done, only while NTI_CNT is zero (rwh) */
    Ifx_Strict_32Bit CDSI:1;                /**< \brief [24:24] Calculation of STATE duration done (rwh) */
    Ifx_Strict_32Bit TORI:1;                /**< \brief [25:25] TRIGGER out of range interrupt (rwh) */
    Ifx_Strict_32Bit SORI:1;                /**< \brief [26:26] STATE out of range (rwh) */
    Ifx_Strict_32Bit DCGI:1;                /**< \brief [27:27] Direction change interrupt (rwh) */
    Ifx_Strict_32Bit reserved_28:4;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_IRQ_NOTIFY_Bits;

/** \\brief  DPLL Number of Active TRIGGER Events to Interrupt */
typedef struct _Ifx_GTM_DPLL_NTI_CNT_Bits
{
    Ifx_Strict_32Bit NTI_CNT:10;            /**< \brief [9:0] Number of TRIGGERs to interrupt (rw) */
    Ifx_Strict_32Bit reserved_10:22;        /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_NTI_CNT_Bits;

/** \\brief  DPLL Number of Recent STATE Events Used for Calculations */
typedef struct _Ifx_GTM_DPLL_NUSC_Bits
{
    Ifx_Strict_32Bit NUSE:6;                /**< \brief [5:0] Number of recent STATE events used for SUB_INCx calculations modulo 2*(SNUmax+1) (rw) */
    Ifx_Strict_32Bit FSS:1;                 /**< \brief [6:6] this value is to be set, when NUSE is set to FULL_SCALE (rw) */
    Ifx_Strict_32Bit SYN_S:6;               /**< \brief [12:7] Number of real and virtual events to be considered for the current increment (rw) */
    Ifx_Strict_32Bit SYN_S_old:6;           /**< \brief [18:13] Number of real and virtual events to be considered for the last increment (rw) */
    Ifx_Strict_32Bit VSN:6;                 /**< \brief [24:19] Virtual STATE number (rw) */
    Ifx_Strict_32Bit reserved_25:4;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit WNUS:1;                /**< \brief [29:29] Write control bit for NUSE; read as zero (w) */
    Ifx_Strict_32Bit WSYN:1;                /**< \brief [30:30] Write control bit for SYN_S and SYN_S_old; read as zero (w) */
    Ifx_Strict_32Bit WVSN:1;                /**< \brief [31:31] Write control bit for VSN; read as zero (w) */
} Ifx_GTM_DPLL_NUSC_Bits;

/** \\brief  DPLL Number of Recent TRIGGER Events Used for Calculations */
typedef struct _Ifx_GTM_DPLL_NUTC_Bits
{
    Ifx_Strict_32Bit NUTE:10;               /**< \brief [9:0] Number of recent TRIGGER events used for SUB_INC1 and action calculations modulo 2*(TNUmax+1) (rw) */
    Ifx_Strict_32Bit FST:1;                 /**< \brief [10:10] this value is to be set, when NUTE is set to FULL_SCALE (rw) */
    Ifx_Strict_32Bit reserved_11:2;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SYN_T:3;               /**< \brief [15:13] Number of real and virtual events to be considered for the current increment (rw) */
    Ifx_Strict_32Bit SYN_T_old:3;           /**< \brief [18:16] Number of real and virtual events to be considered for the last increment (rw) */
    Ifx_Strict_32Bit VTN:6;                 /**< \brief [24:19] Virtual TRIGGER number (rw) */
    Ifx_Strict_32Bit reserved_25:4;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit WNUT:1;                /**< \brief [29:29] Write control bit for NUTE (w) */
    Ifx_Strict_32Bit WSYN:1;                /**< \brief [30:30] Write control bit for SYN_T and SYN_T_old (w) */
    Ifx_Strict_32Bit WVTN:1;                /**< \brief [31:31] Write control bit for VTN (w) */
} Ifx_GTM_DPLL_NUTC_Bits;

/** \\brief  DPLL Offset And Switch Old/New Address Register */
typedef struct _Ifx_GTM_DPLL_OSW_Bits
{
    Ifx_Strict_32Bit SWON_S:1;              /**< \brief [0:0] Switch of new STATE (r) */
    Ifx_Strict_32Bit SWON_T:1;              /**< \brief [1:1] Switch of new TRIGGER (r) */
    Ifx_Strict_32Bit reserved_2:6;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit OSS:2;                 /**< \brief [9:8] Offset size of RAM region 2 (rw) */
    Ifx_Strict_32Bit reserved_10:22;        /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_OSW_Bits;

