HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxGtm_regdef.h
/** \\brief  Calculated Position Value for ACTION_i Register */
typedef struct _Ifx_GTM_DPLL_PSAC_Bits
{
    Ifx_Strict_32Bit PSAC:24;               /**< \brief [23:0] Calculated position value for the start of ACTION_i in normal or emergency mode according to equations 1617 or 1620 respectively (rw) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_PSAC_Bits;

/** \\brief  DPLL RAM Initatlisation Register */
typedef struct _Ifx_GTM_DPLL_RAM_INI_Bits
{
    Ifx_Strict_32Bit INIT_1a:1;             /**< \brief [0:0] RAM region 1a initialization in progress (r) */
    Ifx_Strict_32Bit INIT_1b:1;             /**< \brief [1:1] RAM region 1b initialization in progress (r) */
    Ifx_Strict_32Bit INIT_2:1;              /**< \brief [2:2] RAM region 2 initialization in progress (r) */
    Ifx_Strict_32Bit reserved_3:1;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit INIT_RAM:1;            /**< \brief [4:4] RAM regions 1a, 1b and 2 are to be initialized (w) */
    Ifx_Strict_32Bit reserved_5:27;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_RAM_INI_Bits;

/** \\brief  DPLL Status Register */
typedef struct _Ifx_GTM_DPLL_STATUS_Bits
{
    Ifx_Strict_32Bit CSON:1;                /**< \brief [0:0] Calculated STATE duration overflow nominal (rwh) */
    Ifx_Strict_32Bit CSO:1;                 /**< \brief [1:1] Calculated STATE duration overflow (rwh) */
    Ifx_Strict_32Bit CTON:1;                /**< \brief [2:2] Calculated TRIGGER duration overflow nominal (rwh) */
    Ifx_Strict_32Bit CTO:1;                 /**< \brief [3:3] Calculated TRIGGER duration overflow (rwh) */
    Ifx_Strict_32Bit CRO:1;                 /**< \brief [4:4] Calculated Reciprocal value overflow (w) */
    Ifx_Strict_32Bit RCS:1;                 /**< \brief [5:5] Resolution conflict STATE (r) */
    Ifx_Strict_32Bit RCT:1;                 /**< \brief [6:6] Resolution conflict TRIGGER (r) */
    Ifx_Strict_32Bit PSE:1;                 /**< \brief [7:7] Prediction space configuration error (r) */
    Ifx_Strict_32Bit SOR:1;                 /**< \brief [8:8] STATE out of range The SOR Bit is set, when the time to the next active STATE slope exceeds the value of the last nominal STATE duration multiplied with the value of the SLR register (see ) and is reset, when at the current or last valid input event a direction change was detected. (rwh) */
    Ifx_Strict_32Bit MS:1;                  /**< \brief [9:9] Missing STATE detected (rwh) */
    Ifx_Strict_32Bit TOR:1;                 /**< \brief [10:10] TRIGGER out of range The TOR Bit is set, when the time to the next active TRIGGER slope exceeds the value of the last nominal TRIGGER duration multiplied with the value of the TLR register (see ) and is reset, when at the current or last vaild input event a direction change was detected. The DPLL_STATUS register is reset, when DPLL is disabled (switching DEN from 1 for 0). (rwh) */
    Ifx_Strict_32Bit MT:1;                  /**< \brief [11:11] Missing TRIGGER detected (rwh) */
    Ifx_Strict_32Bit RAM2_ERR:1;            /**< \brief [12:12] DPLL internal access to not configured RAM2 memory (rwh) */
    Ifx_Strict_32Bit reserved_13:2;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit LOW_RES:1;             /**< \brief [15:15] Low resolution of TBU_TS0 is used for DPLL input (r) */
    Ifx_Strict_32Bit CSVS:1;                /**< \brief [16:16] Current signal value STATE (r) */
    Ifx_Strict_32Bit CSVT:1;                /**< \brief [17:17] Current signal value TRIGGER (r) */
    Ifx_Strict_32Bit CAIP2:1;               /**< \brief [18:18] Calculation of actions 12 to 23 in progress (2nd part) (r) */
    Ifx_Strict_32Bit CAIP1:1;               /**< \brief [19:19] Calculation of actions 0 to 11 in progress (1st part) (r) */
    Ifx_Strict_32Bit ISN:1;                 /**< \brief [20:20] Increment number of STATE is not plausible (r) */
    Ifx_Strict_32Bit ITN:1;                 /**< \brief [21:21] Increment number of TRIGGER is not plausible (r) */
    Ifx_Strict_32Bit BWD2:1;                /**< \brief [22:22] Backwards drive of SUB_INC2 (r) */
    Ifx_Strict_32Bit BWD1:1;                /**< \brief [23:23] Backwards drive of SUB_INC1 (r) */
    Ifx_Strict_32Bit reserved_24:1;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit LOCK2:1;               /**< \brief [25:25] DPLL Lock status concerning SUB_INC2 (r) */
    Ifx_Strict_32Bit SYS:1;                 /**< \brief [26:26] Synchronization condition of STATE fixed (r) */
    Ifx_Strict_32Bit SYT:1;                 /**< \brief [27:27] Synchronization condition of TRIGGER fixed (r) */
    Ifx_Strict_32Bit FSD:1;                 /**< \brief [28:28] First STATE detected (r) */
    Ifx_Strict_32Bit FTD:1;                 /**< \brief [29:29] First TRIGGER detected (r) */
    Ifx_Strict_32Bit LOCK1:1;               /**< \brief [30:30] DPLL Lock status concerning SUB_INC1 (r) */
    Ifx_Strict_32Bit ERR:1;                 /**< \brief [31:31] Error during configuration or operation resulting in unexpected values (r) */
} Ifx_GTM_DPLL_STATUS_Bits;

/** \\brief  DPLL TBU_TS0 Value at last STATE Event */
typedef struct _Ifx_GTM_DPLL_TBU_TS0_S_Bits
{
    Ifx_Strict_32Bit TBU_TS0_S:24;          /**< \brief [23:0] value of TBU_TS0 at the last STATE event (rw) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_TBU_TS0_S_Bits;

/** \\brief  DPLL TBU_TS0 Value at last TRIGGER Event */
typedef struct _Ifx_GTM_DPLL_TBU_TS0_T_Bits
{
    Ifx_Strict_32Bit TBU_TS0_T:24;          /**< \brief [23:0] value of TBU_TS0 at the last TRIGGER event (rw) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_TBU_TS0_T_Bits;

/** \\brief  Calculated Time Stamp For ACTION_i Register */
typedef struct _Ifx_GTM_DPLL_TSA_Bits
{
    Ifx_Strict_32Bit TSAC:24;               /**< \brief [23:0] Calculated time stamp for ACTION_i (rw) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_GTM_DPLL_TSA_Bits;

