HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxGtm_regdef.h
/** \\brief  F2A0 Stream Activation Register */
typedef struct _Ifx_GTM_F2A_ENABLE_Bits
{
    Ifx_Strict_32Bit STR0_EN:2;             /**< \brief [1:0] Enable/disable stream 0 (rw) */
    Ifx_Strict_32Bit STR1_EN:2;             /**< \brief [3:2] Enable/disable stream 1 (rw) */
    Ifx_Strict_32Bit STR2_EN:2;             /**< \brief [5:4] Enable/disable stream 2 (rw) */
    Ifx_Strict_32Bit STR3_EN:2;             /**< \brief [7:6] Enable/disable stream 3 (rw) */
    Ifx_Strict_32Bit STR4_EN:2;             /**< \brief [9:8] Enable/disable stream 4 (rw) */
    Ifx_Strict_32Bit STR5_EN:2;             /**< \brief [11:10] Enable/disable stream 5 (rw) */
    Ifx_Strict_32Bit STR6_EN:2;             /**< \brief [13:12] Enable/disable stream 6 (rw) */
    Ifx_Strict_32Bit STR7_EN:2;             /**< \brief [15:14] Enable/disable stream 7 (rw) */
    Ifx_Strict_32Bit reserved_16:16;        /**< \brief \internal Reserved */
} Ifx_GTM_F2A_ENABLE_Bits;

/** \\brief  F2A Read Channel Address Register */
typedef struct _Ifx_GTM_F2A_RD_CH_ARU_RD_FIFO_Bits
{
    Ifx_Strict_32Bit ADDR:9;                /**< \brief [8:0] ARU Read address (rw) */
    Ifx_Strict_32Bit reserved_9:23;         /**< \brief \internal Reserved */
} Ifx_GTM_F2A_RD_CH_ARU_RD_FIFO_Bits;

/** \\brief  F2A Stream Configuration Register */
typedef struct _Ifx_GTM_F2A_STR_CH_STR_CFG_Bits
{
    Ifx_Strict_32Bit reserved_0:16;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit TMODE:2;               /**< \brief [17:16] Transfer mode for 53 bit ARU data from/to FIFO (rw) */
    Ifx_Strict_32Bit DIR:1;                 /**< \brief [18:18] Data transfer direction (rw) */
    Ifx_Strict_32Bit reserved_19:13;        /**< \brief \internal Reserved */
} Ifx_GTM_F2A_STR_CH_STR_CFG_Bits;

/** \\brief  FIFO0 Channel Control Register */
typedef struct _Ifx_GTM_FIFO_CH_CTRL_Bits
{
    Ifx_Strict_32Bit RBM:1;                 /**< \brief [0:0] Ring buffer mode enable (rw) */
    Ifx_Strict_32Bit RAP:1;                 /**< \brief [1:1] RAM access priority (rw) */
    Ifx_Strict_32Bit FLUSH:1;               /**< \brief [2:2] FIFO Flush control (w) */
    Ifx_Strict_32Bit WULOCK:1;              /**< \brief [3:3] RAM write unlock Enable/disable direct RAM write access to the memory mapped FIFO region (rw) */
    Ifx_Strict_32Bit reserved_4:28;         /**< \brief \internal Reserved */
} Ifx_GTM_FIFO_CH_CTRL_Bits;

/** \\brief  FIFO0 Channel End Address Register */
typedef struct _Ifx_GTM_FIFO_CH_END_ADDR_Bits
{
    Ifx_Strict_32Bit ADDR:10;               /**< \brief [9:0] End address for FIFOi channel x, (x:0...7) (rw) */
    Ifx_Strict_32Bit reserved_10:22;        /**< \brief \internal Reserved */
} Ifx_GTM_FIFO_CH_END_ADDR_Bits;

/** \\brief  FIFO0 Channel Fill Level Register */
typedef struct _Ifx_GTM_FIFO_CH_FILL_LEVEL_Bits
{
    Ifx_Strict_32Bit LEVEL:11;              /**< \brief [10:0] Fill level of the current FIFO (r) */
    Ifx_Strict_32Bit reserved_11:21;        /**< \brief \internal Reserved */
} Ifx_GTM_FIFO_CH_FILL_LEVEL_Bits;

/** \\brief  FIFO0 Channel Interrupt Enable Register */
typedef struct _Ifx_GTM_FIFO_CH_IRQ_IRQ_EN_Bits
{
    Ifx_Strict_32Bit FIFO_EMPTY_IRQ_EN:1;   /**< \brief [0:0] interrupt enable (rw) */
    Ifx_Strict_32Bit FIFO_FULL_IRQ_EN:1;    /**< \brief [1:1] interrupt enable (rw) */
    Ifx_Strict_32Bit FIFO_LWM_IRQ_EN:1;     /**< \brief [2:2] interrupt enable (rw) */
    Ifx_Strict_32Bit FIFO_UWM_IRQ_EN:1;     /**< \brief [3:3] interrupt enable (rw) */
    Ifx_Strict_32Bit reserved_4:28;         /**< \brief \internal Reserved */
} Ifx_GTM_FIFO_CH_IRQ_IRQ_EN_Bits;

/** \\brief  FIFO0 Channel Force Interrupt By Software Register */
typedef struct _Ifx_GTM_FIFO_CH_IRQ_IRQ_FORCINT_Bits
{
    Ifx_Strict_32Bit TRG_FIFO_EMPTY:1;      /**< \brief [0:0] Force interrupt of FIFO empty status (w) */
    Ifx_Strict_32Bit TRG_FIFO_FULL:1;       /**< \brief [1:1] Force interrupt of FIFO full status (w) */
    Ifx_Strict_32Bit TRG_FIFO_LWM:1;        /**< \brief [2:2] Force interrupt of lower watermark (w) */
    Ifx_Strict_32Bit TRG_FIFO_UWM:1;        /**< \brief [3:3] Force interrupt of upper watermark (w) */
    Ifx_Strict_32Bit reserved_4:28;         /**< \brief \internal Reserved */
} Ifx_GTM_FIFO_CH_IRQ_IRQ_FORCINT_Bits;

/** \\brief  FIFO0 Channel IRQ Mode Control Register */
typedef struct _Ifx_GTM_FIFO_CH_IRQ_IRQ_MODE_Bits
{
    Ifx_Strict_32Bit IRQ_MODE:2;            /**< \brief [1:0] IRQ mode selection (rw) */
    Ifx_Strict_32Bit DMA_HYSTERESIS:1;      /**< \brief [2:2] Enable DMA hysteresis mode (rw) */
    Ifx_Strict_32Bit DMA_HYST_DIR:1;        /**< \brief [3:3] DMA direction in hysteresis mode (rw) */
    Ifx_Strict_32Bit reserved_4:28;         /**< \brief \internal Reserved */
} Ifx_GTM_FIFO_CH_IRQ_IRQ_MODE_Bits;

/** \\brief  FIFO0 Channel Interrupt Notification Register */
typedef struct _Ifx_GTM_FIFO_CH_IRQ_IRQ_NOTIFY_Bits
{
    Ifx_Strict_32Bit FIFO_EMPTY:1;          /**< \brief [0:0] FIFO is empty (rwh) */
    Ifx_Strict_32Bit FIFO_FULL:1;           /**< \brief [1:1] FIFO is full (rwh) */
    Ifx_Strict_32Bit FIFO_LWM:1;            /**< \brief [2:2] FIFO Lower watermark was under-run (rwh) */
    Ifx_Strict_32Bit FIFO_UWM:1;            /**< \brief [3:3] FIFO Upper watermark was over-run (rwh) */
    Ifx_Strict_32Bit reserved_4:28;         /**< \brief \internal Reserved */
} Ifx_GTM_FIFO_CH_IRQ_IRQ_NOTIFY_Bits;

/** \\brief  FIFO0 Channel Lower Watermark Register */
typedef struct _Ifx_GTM_FIFO_CH_LOWER_WM_Bits
{
    Ifx_Strict_32Bit ADDR:10;               /**< \brief [9:0] Normal Operation mode Upper watermark Ring buffer operation mode Gate pointer from LWU to UWE (rw) */
    Ifx_Strict_32Bit reserved_10:22;        /**< \brief \internal Reserved */
} Ifx_GTM_FIFO_CH_LOWER_WM_Bits;

/** \\brief  FIFO0 Channel Read Pointer Register */
typedef struct _Ifx_GTM_FIFO_CH_PTR_RD_PTR_Bits
{
    Ifx_Strict_32Bit ADDR:10;               /**< \brief [9:0] Position of the read pointer (r) */
    Ifx_Strict_32Bit reserved_10:22;        /**< \brief \internal Reserved */
} Ifx_GTM_FIFO_CH_PTR_RD_PTR_Bits;

/** \\brief  FIFO0 Channel Write Pointer Register */
typedef struct _Ifx_GTM_FIFO_CH_PTR_WR_PTR_Bits
{
    Ifx_Strict_32Bit ADDR:10;               /**< \brief [9:0] Position of the write pointer (r) */
    Ifx_Strict_32Bit reserved_10:22;        /**< \brief \internal Reserved */
} Ifx_GTM_FIFO_CH_PTR_WR_PTR_Bits;

/** \\brief  FIFO0 Channel Start Address Register */
typedef struct _Ifx_GTM_FIFO_CH_START_ADDR_Bits
{
    Ifx_Strict_32Bit ADDR:10;               /**< \brief [9:0] End address for FIFOi channel x, (x07) (rw) */
    Ifx_Strict_32Bit reserved_10:22;        /**< \brief \internal Reserved */
} Ifx_GTM_FIFO_CH_START_ADDR_Bits;

/** \\brief  FIFO0 Channel Status Register */
typedef struct _Ifx_GTM_FIFO_CH_STATUS_Bits
{
    Ifx_Strict_32Bit EMPTY:1;               /**< \brief [0:0] FIFO x fill level status (x07) (r) */
    Ifx_Strict_32Bit FULL:1;                /**< \brief [1:1] FIFO x fill level status (x07) (r) */
    Ifx_Strict_32Bit LOW_WM:1;              /**< \brief [2:2] Lower watermark reached (r) */
    Ifx_Strict_32Bit UP_WM:1;               /**< \brief [3:3] Upper watermark reached (r) */
    Ifx_Strict_32Bit reserved_4:28;         /**< \brief \internal Reserved */
} Ifx_GTM_FIFO_CH_STATUS_Bits;

/** \\brief  FIFO0 Channel Upper Watermark Register */
typedef struct _Ifx_GTM_FIFO_CH_UPPER_WM_Bits
{
    Ifx_Strict_32Bit ADDR:10;               /**< \brief [9:0] Normal Operation mode Upper watermark Ring buffer operation mode Gate pointer from SLW to LWU (rw) */
    Ifx_Strict_32Bit reserved_10:22;        /**< \brief \internal Reserved */
} Ifx_GTM_FIFO_CH_UPPER_WM_Bits;

/** \\brief  GTM Infrastructure Interrupt Group */
typedef struct _Ifx_GTM_ICM_IRQG_0_Bits
{
    Ifx_Strict_32Bit ARU_NEW_DATA0_IRQ:1;   /**< \brief [0:0] ARU_NEW_DATA0 interrupt (rh) */
    Ifx_Strict_32Bit ARU_NEW_DATA1_IRQ:1;   /**< \brief [1:1] ARU_NEW_DATA1 interrupt (rh) */
    Ifx_Strict_32Bit ARU_ACC_ACK_IRQ:1;     /**< \brief [2:2] ARU_ACC_ACK interrupt (rh) */
    Ifx_Strict_32Bit BRC_IRQ:1;             /**< \brief [3:3] BRC shared submodule interrupt (rh) */
    Ifx_Strict_32Bit AEI_IRQ:1;             /**< \brief [4:4] AEI_IRQ interrupt (rh) */
    Ifx_Strict_32Bit CMP_IRQ:1;             /**< \brief [5:5] CMP shared submodule interrupt (rh) */
    Ifx_Strict_32Bit SPE0_IRQ:1;            /**< \brief [6:6] SPE0 shared submodule interrupt (rh) */
    Ifx_Strict_32Bit SPE1_IRQ:1;            /**< \brief [7:7] SPE1 shared submodule interrupt (rh) */
    Ifx_Strict_32Bit reserved_8:8;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit PSM0_CH0_IRQ:1;        /**< \brief [16:16] PSM0 shared submodule channel 0 interrupt (rh) */
    Ifx_Strict_32Bit PSM0_CH1_IRQ:1;        /**< \brief [17:17] PSM0 shared submodule channel 1 interrupt (rh) */
    Ifx_Strict_32Bit PSM0_CH2_IRQ:1;        /**< \brief [18:18] PSM0 shared submodule channel 2 interrupt (rh) */
    Ifx_Strict_32Bit PSM0_CH3_IRQ:1;        /**< \brief [19:19] PSM0 shared submodule channel 3 interrupt (rh) */
    Ifx_Strict_32Bit PSM0_CH4_IRQ:1;        /**< \brief [20:20] PSM0 shared submodule channel 4 interrupt (rh) */
    Ifx_Strict_32Bit PSM0_CH5_IRQ:1;        /**< \brief [21:21] PSM0 shared submodule channel 5 interrupt (rh) */
    Ifx_Strict_32Bit PSM0_CH6_IRQ:1;        /**< \brief [22:22] PSM0 shared submodule channel 6 interrupt (rh) */
    Ifx_Strict_32Bit PSM0_CH7_IRQ:1;        /**< \brief [23:23] PSM0 shared submodule channel 7 interrupt (rh) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_GTM_ICM_IRQG_0_Bits;

/** \\brief  ATOM Interrupt Group 1 */
typedef struct _Ifx_GTM_ICM_IRQG_10_Bits
{
    Ifx_Strict_32Bit ATOM4_CH0_IRQ:1;       /**< \brief [0:0] ATOM4 channel 0 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM4_CH1_IRQ:1;       /**< \brief [1:1] ATOM4 channel 1 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM4_CH2_IRQ:1;       /**< \brief [2:2] ATOM4 channel 2 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM4_CH3_IRQ:1;       /**< \brief [3:3] ATOM4 channel 3 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM4_CH4_IRQ:1;       /**< \brief [4:4] ATOM4 channel 4 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM4_CH5_IRQ:1;       /**< \brief [5:5] ATOM4 channel 5 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM4_CH6_IRQ:1;       /**< \brief [6:6] ATOM4 channel 6 shared interrupt (rh) */
    Ifx_Strict_32Bit ATOM4_CH7_IRQ:1;       /**< \brief [7:7] ATOM4 channel 7 shared interrupt (rh) */
    Ifx_Strict_32Bit reserved_8:24;         /**< \brief \internal Reserved */
} Ifx_GTM_ICM_IRQG_10_Bits;

/** \\brief  GTM DPLL Interrupt Group */
typedef struct _Ifx_GTM_ICM_IRQG_1_Bits
{
    Ifx_Strict_32Bit DPLL_DCG_IRQ:1;        /**< \brief [0:0] TRIGGER direction change detected. (rh) */
    Ifx_Strict_32Bit DPLL_EDI_IRQ:1;        /**< \brief [1:1] DPLL enable/disable interrupt (rh) */
    Ifx_Strict_32Bit DPLL_TIN_IRQ:1;        /**< \brief [2:2] TRIGGER minimum hold time (THMI) violation detected interrupt (rh) */
    Ifx_Strict_32Bit DPLL_TAX_IRQ:1;        /**< \brief [3:3] TRIGGER maximum hold time (THMA) violation detected interrupt (rh) */
    Ifx_Strict_32Bit DPLL_SIS_IRQ:1;        /**< \brief [4:4] STATE inactive slope detected interrupt. See bit 0. (rh) */
    Ifx_Strict_32Bit DPLL_TIS_IRQ:1;        /**< \brief [5:5] TRIGGER inactive slope detected interrupt. See bit 0. (rh) */
    Ifx_Strict_32Bit DPLL_MSI_IRQ:1;        /**< \brief [6:6] Missing STATE interrupt (rh) */
    Ifx_Strict_32Bit DPLL_MTI_IRQ:1;        /**< \brief [7:7] Missing TRIGGER interrupt (rh) */
    Ifx_Strict_32Bit DPLL_SAS_IRQ:1;        /**< \brief [8:8] STATE active slope detected (rh) */
    Ifx_Strict_32Bit DPLL_TAS_IRQ:1;        /**< \brief [9:9] TRIGGER active slope detected while NTI_CNT is zero (rh) */
    Ifx_Strict_32Bit DPLL_PWI_IRQ:1;        /**< \brief [10:10] Plausibility window (PVT) violation interrupt of TRIGGER (rh) */
    Ifx_Strict_32Bit DPLL_W2I_IRQ:1;        /**< \brief [11:11] Write access to RAM region 2 interrupt (rh) */
    Ifx_Strict_32Bit DPLL_W1I_IRQ:1;        /**< \brief [12:12] Write access to RAM region 1b or 1c interrupt (rh) */
    Ifx_Strict_32Bit DPLL_GLI_IRQ:1;        /**< \brief [13:13] Get of lock interrupt for SUB_INC1 (rh) */
    Ifx_Strict_32Bit DPLL_LLI_IRQ:1;        /**< \brief [14:14] Lost of lock interrupt for SUB_INC1 (rh) */
    Ifx_Strict_32Bit DPLL_EI_IRQ:1;         /**< \brief [15:15] Error interrupt See bit 0 (rh) */
    Ifx_Strict_32Bit DPLL_GL2I_IRQ:1;       /**< \brief [16:16] Get of lock interrupt for SUB_INC2 (rh) */
    Ifx_Strict_32Bit DPLL_LL2I_IRQ:1;       /**< \brief [17:17] Lost of lock interrupt for SUB_INC2 (rh) */
    Ifx_Strict_32Bit DPLL_TE0_IRQ:1;        /**< \brief [18:18] TRIGGER event interrupt 0 (rh) */
    Ifx_Strict_32Bit DPLL_TE1_IRQ:1;        /**< \brief [19:19] TRIGGER event interrupt 1 (rh) */
    Ifx_Strict_32Bit DPLL_TE2_IRQ:1;        /**< \brief [20:20] TRIGGER event interrupt 2 (rh) */
    Ifx_Strict_32Bit DPLL_TE3_IRQ:1;        /**< \brief [21:21] TRIGGER event interrupt 3 (rh) */
    Ifx_Strict_32Bit DPLL_TE4_IRQ:1;        /**< \brief [22:22] TRIGGER event interrupt 4 (rh) */
    Ifx_Strict_32Bit DPLL_CDIT_IRQ:1;       /**< \brief [23:23] DPLL calculated duration interrupt for trigger (rh) */
    Ifx_Strict_32Bit DPLL_CDIS_IRQ:1;       /**< \brief [24:24] DPLL calculated duration interrupt for state (rh) */
    Ifx_Strict_32Bit DPLL_TORI_IRQ:1;       /**< \brief [25:25] DPLL calculated duration interrupt for state (rh) */
    Ifx_Strict_32Bit DPLL_SORI_IRQ:1;       /**< \brief [26:26] DPLL calculated duration interrupt for state (rh) */
    Ifx_Strict_32Bit reserved_27:5;         /**< \brief \internal Reserved */
} Ifx_GTM_ICM_IRQG_1_Bits;

