HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxGtm_regdef.h
/** \\brief  TIM Interrupt Group 0 */
typedef struct _Ifx_GTM_ICM_IRQG_2_Bits
{
    Ifx_Strict_32Bit TIM0_CH0_IRQ:1;        /**< \brief [0:0] TIM0 shared interrupt channel 0. (rh) */
    Ifx_Strict_32Bit TIM0_CH1_IRQ:1;        /**< \brief [1:1] TIM0 shared interrupt channel 1 (rh) */
    Ifx_Strict_32Bit TIM0_CH2_IRQ:1;        /**< \brief [2:2] TIM0 shared interrupt channel 2 (rh) */
    Ifx_Strict_32Bit TIM0_CH3_IRQ:1;        /**< \brief [3:3] TIM0 shared interrupt channel 3 (rh) */
    Ifx_Strict_32Bit TIM0_CH4_IRQ:1;        /**< \brief [4:4] TIM0 shared interrupt channel 4 (rh) */
    Ifx_Strict_32Bit TIM0_CH5_IRQ:1;        /**< \brief [5:5] TIM0 shared interrupt channel 5 (rh) */
    Ifx_Strict_32Bit TIM0_CH6_IRQ:1;        /**< \brief [6:6] TIM0 shared interrupt channel 6 (rh) */
    Ifx_Strict_32Bit TIM0_CH7_IRQ:1;        /**< \brief [7:7] TIM0 shared interrupt channel 7 (rh) */
    Ifx_Strict_32Bit TIM1_CH0_IRQ:1;        /**< \brief [8:8] TIM1 shared interrupt channel 0 (rh) */
    Ifx_Strict_32Bit TIM1_CH1_IRQ:1;        /**< \brief [9:9] TIM1 shared interrupt channel 1 (rh) */
    Ifx_Strict_32Bit TIM1_CH2_IRQ:1;        /**< \brief [10:10] TIM1 shared interrupt channel 2 (rh) */
    Ifx_Strict_32Bit TIM1_CH3_IRQ:1;        /**< \brief [11:11] TIM1 shared interrupt channel 3 (rh) */
    Ifx_Strict_32Bit TIM1_CH4_IRQ:1;        /**< \brief [12:12] TIM1 shared interrupt channel 4 (rh) */
    Ifx_Strict_32Bit TIM1_CH5_IRQ:1;        /**< \brief [13:13] TIM1 shared interrupt channel 5 (rh) */
    Ifx_Strict_32Bit TIM1_CH6_IRQ:1;        /**< \brief [14:14] TIM1 shared interrupt channel 6 (rh) */
    Ifx_Strict_32Bit TIM1_CH7_IRQ:1;        /**< \brief [15:15] TIM1 shared interrupt channel 7 (rh) */
    Ifx_Strict_32Bit TIM2_CH0_IRQ:1;        /**< \brief [16:16] TIM2 shared interrupt channel 0 (rh) */
    Ifx_Strict_32Bit TIM2_CH1_IRQ:1;        /**< \brief [17:17] TIM2 shared interrupt channel 1 (rh) */
    Ifx_Strict_32Bit TIM2_CH2_IRQ:1;        /**< \brief [18:18] TIM2 shared interrupt channel 2 (rh) */
    Ifx_Strict_32Bit TIM2_CH3_IRQ:1;        /**< \brief [19:19] TIM2 shared interrupt channel 3 (rh) */
    Ifx_Strict_32Bit TIM2_CH4_IRQ:1;        /**< \brief [20:20] TIM2 shared interrupt channel 4 (rh) */
    Ifx_Strict_32Bit TIM2_CH5_IRQ:1;        /**< \brief [21:21] TIM2 shared interrupt channel 5 (rh) */
    Ifx_Strict_32Bit TIM2_CH6_IRQ:1;        /**< \brief [22:22] TIM2 shared interrupt channel 6 (rh) */
    Ifx_Strict_32Bit TIM2_CH7_IRQ:1;        /**< \brief [23:23] TIM2 shared interrupt channel 7 (rh) */
    Ifx_Strict_32Bit TIM3_CH0_IRQ:1;        /**< \brief [24:24] TIM3 shared interrupt channel 0 (rh) */
    Ifx_Strict_32Bit TIM3_CH1_IRQ:1;        /**< \brief [25:25] TIM3 shared interrupt channel 1 (rh) */
    Ifx_Strict_32Bit TIM3_CH2_IRQ:1;        /**< \brief [26:26] TIM3 shared interrupt channel 2 (rh) */
    Ifx_Strict_32Bit TIM3_CH3_IRQ:1;        /**< \brief [27:27] TIM3 shared interrupt channel 3 (rh) */
    Ifx_Strict_32Bit TIM3_CH4_IRQ:1;        /**< \brief [28:28] TIM3 shared interrupt channel 4 (rh) */
    Ifx_Strict_32Bit TIM3_CH5_IRQ:1;        /**< \brief [29:29] TIM3 shared interrupt channel 5 (rh) */
    Ifx_Strict_32Bit TIM3_CH6_IRQ:1;        /**< \brief [30:30] TIM3 shared interrupt channel 6 (rh) */
    Ifx_Strict_32Bit TIM3_CH7_IRQ:1;        /**< \brief [31:31] TIM3 shared interrupt channel 7 (rh) */
} Ifx_GTM_ICM_IRQG_2_Bits;

/** \\brief  MCS Interrupt Group 0 */
typedef struct _Ifx_GTM_ICM_IRQG_4_Bits
{
    Ifx_Strict_32Bit MCS0_CH0_IRQ:1;        /**< \brief [0:0] MCS0 channel 0 interrupt (rh) */
    Ifx_Strict_32Bit MCS0_CH1_IRQ:1;        /**< \brief [1:1] MCS0 channel 1 interrupt (rh) */
    Ifx_Strict_32Bit MCS0_CH2_IRQ:1;        /**< \brief [2:2] MCS0 channel 2 interrupt (rh) */
    Ifx_Strict_32Bit MCS0_CH3_IRQ:1;        /**< \brief [3:3] MCS0 channel 3 interrupt (rh) */
    Ifx_Strict_32Bit MCS0_CH4_IRQ:1;        /**< \brief [4:4] MCS0 channel 4 interrupt (rh) */
    Ifx_Strict_32Bit MCS0_CH5_IRQ:1;        /**< \brief [5:5] MCS0 channel 5 interrupt (rh) */
    Ifx_Strict_32Bit MCS0_CH6_IRQ:1;        /**< \brief [6:6] MCS0 channel 6 interrupt (rh) */
    Ifx_Strict_32Bit MCS0_CH7_IRQ:1;        /**< \brief [7:7] MCS0 channel 7 interrupt (rh) */
    Ifx_Strict_32Bit MCS1_CH0_IRQ:1;        /**< \brief [8:8] MCS1 channel 0 interrupt (rh) */
    Ifx_Strict_32Bit MCS1_CH1_IRQ:1;        /**< \brief [9:9] MCS1 channel 1 interrupt (rh) */
    Ifx_Strict_32Bit MCS1_CH2_IRQ:1;        /**< \brief [10:10] MCS1 channel 2 interrupt (rh) */
    Ifx_Strict_32Bit MCS1_CH3_IRQ:1;        /**< \brief [11:11] MCS1 channel 3 interrupt (rh) */
    Ifx_Strict_32Bit MCS1_CH4_IRQ:1;        /**< \brief [12:12] MCS1 channel 4 interrupt (rh) */
    Ifx_Strict_32Bit MCS1_CH5_IRQ:1;        /**< \brief [13:13] MCS1 channel 5 interrupt (rh) */
    Ifx_Strict_32Bit MCS1_CH6_IRQ:1;        /**< \brief [14:14] MCS1 channel 6 interrupt (rh) */
    Ifx_Strict_32Bit MCS1_CH7_IRQ:1;        /**< \brief [15:15] MCS1 channel 7 interrupt (rh) */
    Ifx_Strict_32Bit MCS2_CH0_IRQ:1;        /**< \brief [16:16] MCS1 channel 0 interrupt (rh) */
    Ifx_Strict_32Bit MCS2_CH1_IRQ:1;        /**< \brief [17:17] MCS2 channel 1 interrupt (rh) */
    Ifx_Strict_32Bit MCS2_CH2_IRQ:1;        /**< \brief [18:18] MCS2 channel 2 interrupt (rh) */
    Ifx_Strict_32Bit MCS2_CH3_IRQ:1;        /**< \brief [19:19] MCS2 channel 3 interrupt (rh) */
    Ifx_Strict_32Bit MCS2_CH4_IRQ:1;        /**< \brief [20:20] MCS2 channel 4 interrupt (rh) */
    Ifx_Strict_32Bit MCS2_CH5_IRQ:1;        /**< \brief [21:21] MCS2 channel 5 interrupt (rh) */
    Ifx_Strict_32Bit MCS2_CH6_IRQ:1;        /**< \brief [22:22] MCS2 channel 6 interrupt (rh) */
    Ifx_Strict_32Bit MCS2_CH7_IRQ:1;        /**< \brief [23:23] MCS2 channel 7 interrupt (rh) */
    Ifx_Strict_32Bit MCS3_CH0_IRQ:1;        /**< \brief [24:24] MCS3 channel 0 interrupt (rh) */
    Ifx_Strict_32Bit MCS3_CH1_IRQ:1;        /**< \brief [25:25] MCS3 channel 1 interrupt (rh) */
    Ifx_Strict_32Bit MCS3_CH2_IRQ:1;        /**< \brief [26:26] MCS3 channel 2 interrupt (rh) */
    Ifx_Strict_32Bit MCS3_CH3_IRQ:1;        /**< \brief [27:27] MCS3 channel 3 interrupt (rh) */
    Ifx_Strict_32Bit MCS3_CH4_IRQ:1;        /**< \brief [28:28] MCS3 channel 4 interrupt (rh) */
    Ifx_Strict_32Bit MCS3_CH5_IRQ:1;        /**< \brief [29:29] MCS3 channel 5 interrupt (rh) */
    Ifx_Strict_32Bit MCS3_CH6_IRQ:1;        /**< \brief [30:30] MCS3 channel 6 interrupt (rh) */
    Ifx_Strict_32Bit MCS3_CH7_IRQ:1;        /**< \brief [31:31] MCS3 channel 7 interrupt (rh) */
} Ifx_GTM_ICM_IRQG_4_Bits;

/** \\brief  TOM Interrupt Group 0 */
typedef struct _Ifx_GTM_ICM_IRQG_6_Bits
{
    Ifx_Strict_32Bit TOM0_CH0_IRQ:1;        /**< \brief [0:0] TOM0 channel 0 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM0_CH1_IRQ:1;        /**< \brief [1:1] TOM0 channel 1 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM0_CH2_IRQ:1;        /**< \brief [2:2] TOM0 channel 2 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM0_CH3_IRQ:1;        /**< \brief [3:3] TOM0 channel 3 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM0_CH4_IRQ:1;        /**< \brief [4:4] TOM0 channel 4 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM0_CH5_IRQ:1;        /**< \brief [5:5] TOM0 channel 5 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM0_CH6_IRQ:1;        /**< \brief [6:6] TOM0 channel 6 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM0_CH7_IRQ:1;        /**< \brief [7:7] TOM0 channel 7 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM0_CH8_IRQ:1;        /**< \brief [8:8] TOM0 channel 8 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM0_CH9_IRQ:1;        /**< \brief [9:9] TOM0 channel 9 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM0_CH10_IRQ:1;       /**< \brief [10:10] TOM0 channel 10 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM0_CH11_IRQ:1;       /**< \brief [11:11] TOM0 channel 11 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM0_CH12_IRQ:1;       /**< \brief [12:12] TOM0 channel 12 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM0_CH13_IRQ:1;       /**< \brief [13:13] TOM0 channel 13 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM0_CH14_IRQ:1;       /**< \brief [14:14] TOM0 channel 14 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM0_CH15_IRQ:1;       /**< \brief [15:15] TOM0 channel 15 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM1_CH0_IRQ:1;        /**< \brief [16:16] TOM1 channel 0 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM1_CH1_IRQ:1;        /**< \brief [17:17] TOM1 channel 1 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM1_CH2_IRQ:1;        /**< \brief [18:18] TOM1 channel 2 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM1_CH3_IRQ:1;        /**< \brief [19:19] TOM1 channel 3 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM1_CH4_IRQ:1;        /**< \brief [20:20] TOM1 channel 4 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM1_CH5_IRQ:1;        /**< \brief [21:21] TOM1 channel 5 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM1_CH6_IRQ:1;        /**< \brief [22:22] TOM1 channel 6 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM1_CH7_IRQ:1;        /**< \brief [23:23] TOM1 channel 7 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM1_CH8_IRQ:1;        /**< \brief [24:24] TOM1 channel 8 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM1_CH9_IRQ:1;        /**< \brief [25:25] TOM1 channel 9 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM1_CH10_IRQ:1;       /**< \brief [26:26] TOM1 channel 10 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM1_CH11_IRQ:1;       /**< \brief [27:27] TOM1 channel 11 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM1_CH12_IRQ:1;       /**< \brief [28:28] TOM1 channel 12 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM1_CH13_IRQ:1;       /**< \brief [29:29] TOM1 channel 13 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM1_CH14_IRQ:1;       /**< \brief [30:30] TOM1 channel 14 shared interrupt (rh) */
    Ifx_Strict_32Bit TOM1_CH15_IRQ:1;       /**< \brief [31:31] TOM1 channel 15 shared interrupt (rh) */
} Ifx_GTM_ICM_IRQG_6_Bits;

