HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxGtm_regdef.h
/** \\brief  MCS IRQ Mode Configuration Register */
typedef struct _Ifx_GTM_MCS_CH_IRQ_MODE_Bits
{
    Ifx_Strict_32Bit IRQ_MODE:2;            /**< \brief [1:0] IRQ mode selection (rw) */
    Ifx_Strict_32Bit reserved_2:30;         /**< \brief \internal Reserved */
} Ifx_GTM_MCS_CH_IRQ_MODE_Bits;

/** \\brief  MCS Channel interrupt notification register */
typedef struct _Ifx_GTM_MCS_CH_IRQ_NOTIFY_Bits
{
    Ifx_Strict_32Bit MCS_IRQ:1;             /**< \brief [0:0] Interrupt request by MCS-channel x (rwh) */
    Ifx_Strict_32Bit STK_ERR_IRQ:1;         /**< \brief [1:1] Stack counter overflow/underflow of channel x (rwh) */
    Ifx_Strict_32Bit MEM_ERR_IRQ:1;         /**< \brief [2:2] Memory access out of range in channel x (rwh) */
    Ifx_Strict_32Bit reserved_3:29;         /**< \brief \internal Reserved */
} Ifx_GTM_MCS_CH_IRQ_NOTIFY_Bits;

/** \\brief  MCS Channel Program Counter Register */
typedef struct _Ifx_GTM_MCS_CH_PC_Bits
{
    Ifx_Strict_32Bit PC:14;                 /**< \brief [13:0] Current Program Counter (rw) */
    Ifx_Strict_32Bit reserved_14:18;        /**< \brief \internal Reserved */
} Ifx_GTM_MCS_CH_PC_Bits;

/** \\brief  MCS Channel Program Counter Register 0 */
typedef struct _Ifx_GTM_MCS_CH_R0_Bits
{
    Ifx_Strict_32Bit DATA:24;               /**< \brief [23:0] Data of MCS general purpose register ry (rw) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_GTM_MCS_CH_R0_Bits;

/** \\brief  MCS Channel Program Counter Register 1 */
typedef struct _Ifx_GTM_MCS_CH_R1_Bits
{
    Ifx_Strict_32Bit DATA:24;               /**< \brief [23:0] Data of MCS general purpose register ry (rw) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_GTM_MCS_CH_R1_Bits;

/** \\brief  MCS Channel Program Counter Register 2 */
typedef struct _Ifx_GTM_MCS_CH_R2_Bits
{
    Ifx_Strict_32Bit DATA:24;               /**< \brief [23:0] Data of MCS general purpose register ry (rw) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_GTM_MCS_CH_R2_Bits;

/** \\brief  MCS Channel Program Counter Register 3 */
typedef struct _Ifx_GTM_MCS_CH_R3_Bits
{
    Ifx_Strict_32Bit DATA:24;               /**< \brief [23:0] Data of MCS general purpose register ry (rw) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_GTM_MCS_CH_R3_Bits;

/** \\brief  MCS Channel Program Counter Register 4 */
typedef struct _Ifx_GTM_MCS_CH_R4_Bits
{
    Ifx_Strict_32Bit DATA:24;               /**< \brief [23:0] Data of MCS general purpose register ry (rw) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_GTM_MCS_CH_R4_Bits;

/** \\brief  MCS Channel Program Counter Register 5 */
typedef struct _Ifx_GTM_MCS_CH_R5_Bits
{
    Ifx_Strict_32Bit DATA:24;               /**< \brief [23:0] Data of MCS general purpose register ry (rw) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_GTM_MCS_CH_R5_Bits;

/** \\brief  MCS Channel Program Counter Register 6 */
typedef struct _Ifx_GTM_MCS_CH_R6_Bits
{
    Ifx_Strict_32Bit DATA:24;               /**< \brief [23:0] Data of MCS general purpose register ry (rw) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_GTM_MCS_CH_R6_Bits;

/** \\brief  MCS Channel Program Counter Register 7 */
typedef struct _Ifx_GTM_MCS_CH_R7_Bits
{
    Ifx_Strict_32Bit DATA:24;               /**< \brief [23:0] Data of MCS general purpose register ry (rw) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_GTM_MCS_CH_R7_Bits;

/** \\brief  MCS Clear Trigger Control Register */
typedef struct _Ifx_GTM_MCS_CTRG_Bits
{
    Ifx_Strict_32Bit TRG0:1;                /**< \brief [0:0] Trigger bit 0 (rw) */
    Ifx_Strict_32Bit TRG1:1;                /**< \brief [1:1] Trigger bit 1 (rw) */
    Ifx_Strict_32Bit TRG2:1;                /**< \brief [2:2] Trigger bit 2 (rw) */
    Ifx_Strict_32Bit TRG3:1;                /**< \brief [3:3] Trigger bit 3 (rw) */
    Ifx_Strict_32Bit TRG4:1;                /**< \brief [4:4] Trigger bit 4 (rw) */
    Ifx_Strict_32Bit TRG5:1;                /**< \brief [5:5] Trigger bit 5 (rw) */
    Ifx_Strict_32Bit TRG6:1;                /**< \brief [6:6] Trigger bit 6 (rw) */
    Ifx_Strict_32Bit TRG7:1;                /**< \brief [7:7] Trigger bit 7 (rw) */
    Ifx_Strict_32Bit TRG8:1;                /**< \brief [8:8] Trigger bit 8 (rw) */
    Ifx_Strict_32Bit TRG9:1;                /**< \brief [9:9] Trigger bit 9 (rw) */
    Ifx_Strict_32Bit TRG10:1;               /**< \brief [10:10] Trigger bit 10 (rw) */
    Ifx_Strict_32Bit TRG11:1;               /**< \brief [11:11] Trigger bit 11 (rw) */
    Ifx_Strict_32Bit TRG12:1;               /**< \brief [12:12] Trigger bit 12 (rw) */
    Ifx_Strict_32Bit TRG13:1;               /**< \brief [13:13] Trigger bit 13 (rw) */
    Ifx_Strict_32Bit TRG14:1;               /**< \brief [14:14] Trigger bit 14 (rw) */
    Ifx_Strict_32Bit TRG15:1;               /**< \brief [15:15] Trigger bit 15 (rw) */
    Ifx_Strict_32Bit reserved_16:16;        /**< \brief \internal Reserved */
} Ifx_GTM_MCS_CTRG_Bits;

/** \\brief  MCS Control Register */
typedef struct _Ifx_GTM_MCS_CTRL_Bits
{
    Ifx_Strict_32Bit SCHED:1;               /**< \brief [0:0] MCS submodule scheduling scheme (rw) */
    Ifx_Strict_32Bit HLT_SP_OFL:1;          /**< \brief [1:1] Halt on stack pointer overflow (rw) */
    Ifx_Strict_32Bit reserved_2:14;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit RAM_RST:1;             /**< \brief [16:16] RAM reset bit (r) */
    Ifx_Strict_32Bit reserved_17:15;        /**< \brief \internal Reserved */
} Ifx_GTM_MCS_CTRL_Bits;

/** \\brief  MCS Error Register */
typedef struct _Ifx_GTM_MCS_ERR_Bits
{
    Ifx_Strict_32Bit ERR0:1;                /**< \brief [0:0] Error State of MCS-channel 0 (rwh) */
    Ifx_Strict_32Bit ERR1:1;                /**< \brief [1:1] Error State of MCS-channel 1 (rwh) */
    Ifx_Strict_32Bit ERR2:1;                /**< \brief [2:2] Error State of MCS-channel 2 (rwh) */
    Ifx_Strict_32Bit ERR3:1;                /**< \brief [3:3] Error State of MCS-channel3 (rwh) */
    Ifx_Strict_32Bit ERR4:1;                /**< \brief [4:4] Error State of MCS-channel 4 (rwh) */
    Ifx_Strict_32Bit ERR5:1;                /**< \brief [5:5] Error State of MCS-channel 5 (rwh) */
    Ifx_Strict_32Bit ERR6:1;                /**< \brief [6:6] Error State of MCS-channel 6 (rwh) */
    Ifx_Strict_32Bit ERR7:1;                /**< \brief [7:7] Error State of MCS-channel 7 (rwh) */
    Ifx_Strict_32Bit reserved_8:24;         /**< \brief \internal Reserved */
} Ifx_GTM_MCS_ERR_Bits;

