HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxGtm_regdef.h
/** \\brief  MCS Channel Reset Register */
typedef struct _Ifx_GTM_MCS_RST_Bits
{
    Ifx_Strict_32Bit RST0:1;                /**< \brief [0:0] Software reset of channel 0 (w) */
    Ifx_Strict_32Bit RST1:1;                /**< \brief [1:1] Software reset of channel 1 (w) */
    Ifx_Strict_32Bit RST2:1;                /**< \brief [2:2] Software reset of channel 2 (w) */
    Ifx_Strict_32Bit RST3:1;                /**< \brief [3:3] Software reset of channel 3 (w) */
    Ifx_Strict_32Bit RST4:1;                /**< \brief [4:4] Software reset of channel 4 (w) */
    Ifx_Strict_32Bit RST5:1;                /**< \brief [5:5] Software reset of channel 5 (w) */
    Ifx_Strict_32Bit RST6:1;                /**< \brief [6:6] Software reset of channel 6 (w) */
    Ifx_Strict_32Bit RST7:1;                /**< \brief [7:7] Software reset of channel 7 (w) */
    Ifx_Strict_32Bit CAT0:1;                /**< \brief [8:8] Cancel ARU transfer for channel 0 (rwh) */
    Ifx_Strict_32Bit CAT1:1;                /**< \brief [9:9] Cancel ARU transfer for channel 1 (rwh) */
    Ifx_Strict_32Bit CAT2:1;                /**< \brief [10:10] Cancel ARU transfer for channel 2 (rwh) */
    Ifx_Strict_32Bit CAT3:1;                /**< \brief [11:11] Cancel ARU transfer for channel 3 (rwh) */
    Ifx_Strict_32Bit CAT4:1;                /**< \brief [12:12] Cancel ARU transfer for channel 4 (rwh) */
    Ifx_Strict_32Bit CAT5:1;                /**< \brief [13:13] Cancel ARU transfer for channel 5 (rwh) */
    Ifx_Strict_32Bit CAT6:1;                /**< \brief [14:14] Cancel ARU transfer for channel 6 (rwh) */
    Ifx_Strict_32Bit CAT7:1;                /**< \brief [15:15] Cancel ARU transfer for channel 7 (rwh) */
    Ifx_Strict_32Bit CWT0:1;                /**< \brief [16:16] Cancel WURM instruction for channel 0 (rwh) */
    Ifx_Strict_32Bit CWT1:1;                /**< \brief [17:17] Cancel WURM instruction for channel 1 (rwh) */
    Ifx_Strict_32Bit CWT2:1;                /**< \brief [18:18] Cancel WURM instruction for channel 2 (rwh) */
    Ifx_Strict_32Bit CWT3:1;                /**< \brief [19:19] Cancel WURM instruction for channel 3 (rwh) */
    Ifx_Strict_32Bit CWT4:1;                /**< \brief [20:20] Cancel WURM instruction for channel 4 (rwh) */
    Ifx_Strict_32Bit CWT5:1;                /**< \brief [21:21] Cancel WURM instruction for channel 5 (rwh) */
    Ifx_Strict_32Bit CWT6:1;                /**< \brief [22:22] Cancel WURM instruction for channel 6 (rwh) */
    Ifx_Strict_32Bit CWT7:1;                /**< \brief [23:23] Cancel WURM instruction for channel 7 (rwh) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_GTM_MCS_RST_Bits;

/** \\brief  MCS Set Trigger Control Register */
typedef struct _Ifx_GTM_MCS_STRG_Bits
{
    Ifx_Strict_32Bit TRG0:1;                /**< \brief [0:0] Trigger bit 0 (rw) */
    Ifx_Strict_32Bit TRG1:1;                /**< \brief [1:1] Trigger bit 1 (rw) */
    Ifx_Strict_32Bit TRG2:1;                /**< \brief [2:2] Trigger bit 2 (rw) */
    Ifx_Strict_32Bit TRG3:1;                /**< \brief [3:3] Trigger bit 3 (rw) */
    Ifx_Strict_32Bit TRG4:1;                /**< \brief [4:4] Trigger bit 4 (rw) */
    Ifx_Strict_32Bit TRG5:1;                /**< \brief [5:5] Trigger bit 5 (rw) */
    Ifx_Strict_32Bit TRG6:1;                /**< \brief [6:6] Trigger bit 6 (rw) */
    Ifx_Strict_32Bit TRG7:1;                /**< \brief [7:7] Trigger bit 7 (rw) */
    Ifx_Strict_32Bit TRG8:1;                /**< \brief [8:8] trigger bit 8 (rw) */
    Ifx_Strict_32Bit TRG9:1;                /**< \brief [9:9] Trigger bit 9 (rw) */
    Ifx_Strict_32Bit TRG10:1;               /**< \brief [10:10] Trigger bit 10 (rw) */
    Ifx_Strict_32Bit TRG11:1;               /**< \brief [11:11] Trigger bit 11 (rw) */
    Ifx_Strict_32Bit TRG12:1;               /**< \brief [12:12] Trigger bit 12 (rw) */
    Ifx_Strict_32Bit TRG13:1;               /**< \brief [13:13] Trigger bit 13 (rw) */
    Ifx_Strict_32Bit TRG14:1;               /**< \brief [14:14] Trigger bit 14 (rw) */
    Ifx_Strict_32Bit TRG15:1;               /**< \brief [15:15] Trigger bit 15 (rw) */
    Ifx_Strict_32Bit reserved_16:16;        /**< \brief \internal Reserved */
} Ifx_GTM_MCS_STRG_Bits;

/** \\brief  Monitor Activity Register 0 */
typedef struct _Ifx_GTM_MON_ACTIVITY_0_Bits
{
    Ifx_Strict_32Bit MCA_0_0:1;             /**< \brief [0:0] Activity of check performed in module MCS[0] at channel 0 (rwh) */
    Ifx_Strict_32Bit MCA_0_1:1;             /**< \brief [1:1] Activity of check performed in module MCS[0] at channel 1 (rwh) */
    Ifx_Strict_32Bit MCA_0_2:1;             /**< \brief [2:2] Activity of check performed in module MCS[0] at channel 2 (rwh) */
    Ifx_Strict_32Bit MCA_0_3:1;             /**< \brief [3:3] Activity of check performed in module MCS[0] at channel 3 (rwh) */
    Ifx_Strict_32Bit MCA_0_4:1;             /**< \brief [4:4] Activity of check performed in module MCS[0] at channel 4 (rwh) */
    Ifx_Strict_32Bit MCA_0_5:1;             /**< \brief [5:5] Activity of check performed in module MCS[0] at channel 5 (rwh) */
    Ifx_Strict_32Bit MCA_0_6:1;             /**< \brief [6:6] Activity of check performed in module MCS[0] at channel 6 (rwh) */
    Ifx_Strict_32Bit MCA_0_7:1;             /**< \brief [7:7] Activity of check performed in module MCS[0] at channel 7 (rwh) */
    Ifx_Strict_32Bit MCA_1_0:1;             /**< \brief [8:8] Activity of check performed in module MCS[1] at channel 0 (rwh) */
    Ifx_Strict_32Bit MCA_1_1:1;             /**< \brief [9:9] Activity of check performed in module MCS[1] at channel 1 (rwh) */
    Ifx_Strict_32Bit MCA_1_2:1;             /**< \brief [10:10] Activity of check performed in module MCS[1] at channel 2 (rwh) */
    Ifx_Strict_32Bit MCA_1_3:1;             /**< \brief [11:11] Activity of check performed in module MCS[1] at channel 3 (rwh) */
    Ifx_Strict_32Bit MCA_1_4:1;             /**< \brief [12:12] Activity of check performed in module MCS[1] at channel 4 (rwh) */
    Ifx_Strict_32Bit MCA_1_5:1;             /**< \brief [13:13] Activity of check performed in module MCS[1] at channel 5 (rwh) */
    Ifx_Strict_32Bit MCA_1_6:1;             /**< \brief [14:14] Activity of check performed in module MCS[1] at channel 6 (rwh) */
    Ifx_Strict_32Bit MCA_1_7:1;             /**< \brief [15:15] Activity of check performed in module MCS[1] at channel 7 (rwh) */
    Ifx_Strict_32Bit MCA_2_0:1;             /**< \brief [16:16] Activity of check performed in module MCS[2] at channel 0 (rwh) */
    Ifx_Strict_32Bit MCA_2_1:1;             /**< \brief [17:17] Activity of check performed in module MCS[2] at channel 1 (rwh) */
    Ifx_Strict_32Bit MCA_2_2:1;             /**< \brief [18:18] Activity of check performed in module MCS[2] at channel 2 (rwh) */
    Ifx_Strict_32Bit MCA_2_3:1;             /**< \brief [19:19] Activity of check performed in module MCS[2] at channel 3 (rwh) */
    Ifx_Strict_32Bit MCA_2_4:1;             /**< \brief [20:20] Activity of check performed in module MCS[2] at channel 4 (rwh) */
    Ifx_Strict_32Bit MCA_2_5:1;             /**< \brief [21:21] Activity of check performed in module MCS[2] at channel 5 (rwh) */
    Ifx_Strict_32Bit MCA_2_6:1;             /**< \brief [22:22] Activity of check performed in module MCS[2] at channel 6 (rwh) */
    Ifx_Strict_32Bit MCA_2_7:1;             /**< \brief [23:23] Activity of check performed in module MCS[2] at channel 7 (rwh) */
    Ifx_Strict_32Bit MCA_3_0:1;             /**< \brief [24:24] Activity of check performed in module MCS[3] at channel 0 (rwh) */
    Ifx_Strict_32Bit MCA_3_1:1;             /**< \brief [25:25] Activity of check performed in module MCS[3] at channel 1 (rwh) */
    Ifx_Strict_32Bit MCA_3_2:1;             /**< \brief [26:26] Activity of check performed in module MCS[3] at channel 2 (rwh) */
    Ifx_Strict_32Bit MCA_3_3:1;             /**< \brief [27:27] Activity of check performed in module MCS[3] at channel 3 (rwh) */
    Ifx_Strict_32Bit MCA_3_4:1;             /**< \brief [28:28] Activity of check performed in module MCS[3] at channel 4 (rwh) */
    Ifx_Strict_32Bit MCA_3_5:1;             /**< \brief [29:29] Activity of check performed in module MCS[3] at channel 5 (rwh) */
    Ifx_Strict_32Bit MCA_3_6:1;             /**< \brief [30:30] Activity of check performed in module MCS[3] at channel 6 (rwh) */
    Ifx_Strict_32Bit MCA_3_7:1;             /**< \brief [31:31] Activity of check performed in module MCS[3] at channel 7 (rwh) */
} Ifx_GTM_MON_ACTIVITY_0_Bits;

/** \\brief  Monitor Status Register */
typedef struct _Ifx_GTM_MON_STATUS_Bits
{
    Ifx_Strict_32Bit ACT_CMU0:1;            /**< \brief [0:0] CMU_CLK0 activity (rwh) */
    Ifx_Strict_32Bit ACT_CMU1:1;            /**< \brief [1:1] CMU_CLK1 activity (rwh) */
    Ifx_Strict_32Bit ACT_CMU2:1;            /**< \brief [2:2] CMU_CLK2 activity (rwh) */
    Ifx_Strict_32Bit ACT_CMU3:1;            /**< \brief [3:3] CMU_CLK3 activity (rwh) */
    Ifx_Strict_32Bit ACT_CMU4:1;            /**< \brief [4:4] CMU_CLK4 activity (rwh) */
    Ifx_Strict_32Bit ACT_CMU5:1;            /**< \brief [5:5] CMU_CLK5 activity (rwh) */
    Ifx_Strict_32Bit ACT_CMU6:1;            /**< \brief [6:6] CMU_CLK6 activity (rwh) */
    Ifx_Strict_32Bit ACT_CMU7:1;            /**< \brief [7:7] CMU_CLK7 activity (rwh) */
    Ifx_Strict_32Bit ACT_CMUFX0:1;          /**< \brief [8:8] CMU_CLKFX0 activity (rwh) */
    Ifx_Strict_32Bit ACT_CMUFX1:1;          /**< \brief [9:9] CMU_CLKFX1 activity (rwh) */
    Ifx_Strict_32Bit ACT_CMUFX2:1;          /**< \brief [10:10] CMU_CLKFX2 activity (rwh) */
    Ifx_Strict_32Bit ACT_CMUFX3:1;          /**< \brief [11:11] CMU_CLKFX3 activity (rwh) */
    Ifx_Strict_32Bit ACT_CMUFX4:1;          /**< \brief [12:12] CMU_CLKFX4 activity (rwh) */
    Ifx_Strict_32Bit reserved_13:3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit CMP_ERR:1;             /**< \brief [16:16] Error detected at CMP (r) */
    Ifx_Strict_32Bit reserved_17:3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit MCS0_ERR:1;            /**< \brief [20:20] Error detected at MCS[0] (r) */
    Ifx_Strict_32Bit MCS1_ERR:1;            /**< \brief [21:21] Error detected at MCS[1] (r) */
    Ifx_Strict_32Bit MCS2_ERR:1;            /**< \brief [22:22] Error detected at MCS[2] (r) */
    Ifx_Strict_32Bit MCS3_ERR:1;            /**< \brief [23:23] Error detected at MCS[3] (r) */
    Ifx_Strict_32Bit reserved_24:8;         /**< \brief \internal Reserved */
} Ifx_GTM_MON_STATUS_Bits;

/** \\brief  MSC Input High Control Register */
typedef struct _Ifx_GTM_MSCIN_INHCON_Bits
{
    Ifx_Strict_32Bit SEL0:2;                /**< \brief [1:0]  (rw) */
    Ifx_Strict_32Bit SEL1:2;                /**< \brief [3:2]  (rw) */
    Ifx_Strict_32Bit SEL2:2;                /**< \brief [5:4]  (rw) */
    Ifx_Strict_32Bit SEL3:2;                /**< \brief [7:6]  (rw) */
    Ifx_Strict_32Bit SEL4:2;                /**< \brief [9:8]  (rw) */
    Ifx_Strict_32Bit SEL5:2;                /**< \brief [11:10]  (rw) */
    Ifx_Strict_32Bit SEL6:2;                /**< \brief [13:12]  (rw) */
    Ifx_Strict_32Bit SEL7:2;                /**< \brief [15:14]  (rw) */
    Ifx_Strict_32Bit SEL8:2;                /**< \brief [17:16]  (rw) */
    Ifx_Strict_32Bit SEL9:2;                /**< \brief [19:18]  (rw) */
    Ifx_Strict_32Bit SEL10:2;               /**< \brief [21:20]  (rw) */
    Ifx_Strict_32Bit SEL11:2;               /**< \brief [23:22]  (rw) */
    Ifx_Strict_32Bit SEL12:2;               /**< \brief [25:24]  (rw) */
    Ifx_Strict_32Bit SEL13:2;               /**< \brief [27:26]  (rw) */
    Ifx_Strict_32Bit SEL14:2;               /**< \brief [29:28]  (rw) */
    Ifx_Strict_32Bit SEL15:2;               /**< \brief [31:30]  (rw) */
} Ifx_GTM_MSCIN_INHCON_Bits;

/** \\brief  MSC Input Low Control Register */
typedef struct _Ifx_GTM_MSCIN_INLCON_Bits
{
    Ifx_Strict_32Bit SEL0:2;                /**< \brief [1:0]  (rw) */
    Ifx_Strict_32Bit SEL1:2;                /**< \brief [3:2]  (rw) */
    Ifx_Strict_32Bit SEL2:2;                /**< \brief [5:4]  (rw) */
    Ifx_Strict_32Bit SEL3:2;                /**< \brief [7:6]  (rw) */
    Ifx_Strict_32Bit SEL4:2;                /**< \brief [9:8]  (rw) */
    Ifx_Strict_32Bit SEL5:2;                /**< \brief [11:10]  (rw) */
    Ifx_Strict_32Bit SEL6:2;                /**< \brief [13:12]  (rw) */
    Ifx_Strict_32Bit SEL7:2;                /**< \brief [15:14]  (rw) */
    Ifx_Strict_32Bit SEL8:2;                /**< \brief [17:16]  (rw) */
    Ifx_Strict_32Bit SEL9:2;                /**< \brief [19:18]  (rw) */
    Ifx_Strict_32Bit SEL10:2;               /**< \brief [21:20]  (rw) */
    Ifx_Strict_32Bit SEL11:2;               /**< \brief [23:22]  (rw) */
    Ifx_Strict_32Bit SEL12:2;               /**< \brief [25:24]  (rw) */
    Ifx_Strict_32Bit SEL13:2;               /**< \brief [27:26]  (rw) */
    Ifx_Strict_32Bit SEL14:2;               /**< \brief [29:28]  (rw) */
    Ifx_Strict_32Bit SEL15:2;               /**< \brief [31:30]  (rw) */
} Ifx_GTM_MSCIN_INLCON_Bits;

/** \\brief  MSC Set Control 0 Register */
typedef struct _Ifx_GTM_MSCSET_CON0_Bits
{
    Ifx_Strict_32Bit SEL0:5;                /**< \brief [4:0]  (rw) */
    Ifx_Strict_32Bit reserved_5:3;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL1:5;                /**< \brief [12:8]  (rw) */
    Ifx_Strict_32Bit reserved_13:3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL2:5;                /**< \brief [20:16]  (rw) */
    Ifx_Strict_32Bit reserved_21:3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL3:5;                /**< \brief [28:24]  (rw) */
    Ifx_Strict_32Bit reserved_29:3;         /**< \brief \internal Reserved */
} Ifx_GTM_MSCSET_CON0_Bits;

/** \\brief  MSC Set Control 1 Register */
typedef struct _Ifx_GTM_MSCSET_CON1_Bits
{
    Ifx_Strict_32Bit SEL4:5;                /**< \brief [4:0]  (rw) */
    Ifx_Strict_32Bit reserved_5:3;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL5:5;                /**< \brief [12:8]  (rw) */
    Ifx_Strict_32Bit reserved_13:3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL6:5;                /**< \brief [20:16]  (rw) */
    Ifx_Strict_32Bit reserved_21:3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL7:5;                /**< \brief [28:24]  (rw) */
    Ifx_Strict_32Bit reserved_29:3;         /**< \brief \internal Reserved */
} Ifx_GTM_MSCSET_CON1_Bits;

/** \\brief  MSC Set Control 2 Register */
typedef struct _Ifx_GTM_MSCSET_CON2_Bits
{
    Ifx_Strict_32Bit SEL8:5;                /**< \brief [4:0]  (rw) */
    Ifx_Strict_32Bit reserved_5:3;          /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL9:5;                /**< \brief [12:8]  (rw) */
    Ifx_Strict_32Bit reserved_13:3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL10:5;               /**< \brief [20:16]  (rw) */
    Ifx_Strict_32Bit reserved_21:3;         /**< \brief \internal Reserved */
    Ifx_Strict_32Bit SEL11:5;               /**< \brief [28:24]  (rw) */
    Ifx_Strict_32Bit reserved_29:3;         /**< \brief \internal Reserved */
} Ifx_GTM_MSCSET_CON2_Bits;

