HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxGtm_regdef.h
/** \\brief  ECLK objects */
typedef volatile struct _Ifx_GTM_CMU_ECLK
{
    Ifx_GTM_CMU_ECLK_NUM NUM;               /**< \brief 0, CMU External Clock Control Numerator Register */
    Ifx_GTM_CMU_ECLK_DEN DEN;               /**< \brief 4, CMU External Clock Control Denominator Register */
} Ifx_GTM_CMU_ECLK;

/** \\brief  F2A ARU RD FIFO address */
typedef volatile struct _Ifx_GTM_F2A_RD_CH
{
    Ifx_GTM_F2A_RD_CH_ARU_RD_FIFO ARU_RD_FIFO;  /**< \brief 0, F2A Read Channel Address Register */
} Ifx_GTM_F2A_RD_CH;

/** \\brief  F2A Stream configuration */
typedef volatile struct _Ifx_GTM_F2A_STR_CH
{
    Ifx_GTM_F2A_STR_CH_STR_CFG STR_CFG;     /**< \brief 0, F2A Stream Configuration Register */
} Ifx_GTM_F2A_STR_CH;

/** \\brief  FIFO channel */
typedef volatile struct _Ifx_GTM_FIFO_CH
{
    Ifx_GTM_FIFO_CH_CTRL CTRL;              /**< \brief 0, FIFO0 Channel Control Register */
    Ifx_GTM_FIFO_CH_END_ADDR END_ADDR;      /**< \brief 4, FIFO0 Channel End Address Register */
    Ifx_GTM_FIFO_CH_START_ADDR START_ADDR;  /**< \brief 8, FIFO0 Channel Start Address Register */
    Ifx_GTM_FIFO_CH_UPPER_WM UPPER_WM;      /**< \brief C, FIFO0 Channel Upper Watermark Register */
    Ifx_GTM_FIFO_CH_LOWER_WM LOWER_WM;      /**< \brief 10, FIFO0 Channel Lower Watermark Register */
    Ifx_GTM_FIFO_CH_STATUS STATUS;          /**< \brief 14, FIFO0 Channel Status Register */
    Ifx_GTM_FIFO_CH_FILL_LEVEL FILL_LEVEL;  /**< \brief 18, FIFO0 Channel Fill Level Register */
    unsigned char reserved_1C[4];           /**< \brief 1C, \internal Reserved */
} Ifx_GTM_FIFO_CH;

/** \\brief  FIFO channel interrupt objects */
typedef volatile struct _Ifx_GTM_FIFO_CH_IRQ
{
    Ifx_GTM_FIFO_CH_IRQ_IRQ_NOTIFY IRQ_NOTIFY;  /**< \brief 0, FIFO0 Channel Interrupt Notification Register */
    Ifx_GTM_FIFO_CH_IRQ_IRQ_EN IRQ_EN;      /**< \brief 4, FIFO0 Channel Interrupt Enable Register */
    Ifx_GTM_FIFO_CH_IRQ_IRQ_FORCINT IRQ_FORCINT;    /**< \brief 8, FIFO0 Channel Force Interrupt By Software Register */
    Ifx_GTM_FIFO_CH_IRQ_IRQ_MODE IRQ_MODE;  /**< \brief C, FIFO0 Channel IRQ Mode Control Register */
    unsigned char reserved_10[16];          /**< \brief 10, \internal Reserved */
} Ifx_GTM_FIFO_CH_IRQ;

/** \\brief  FIFO channel pointer objects */
typedef volatile struct _Ifx_GTM_FIFO_CH_PTR
{
    Ifx_GTM_FIFO_CH_PTR_WR_PTR WR_PTR;      /**< \brief 0, FIFO0 Channel Write Pointer Register */
    Ifx_GTM_FIFO_CH_PTR_RD_PTR RD_PTR;      /**< \brief 4, FIFO0 Channel Read Pointer Register */
    unsigned char reserved_8[24];           /**< \brief 8, \internal Reserved */
} Ifx_GTM_FIFO_CH_PTR;

/** \\brief  CAN */
typedef volatile struct _Ifx_GTM_INOUTSEL_CAN
{
    Ifx_GTM_INOUTSEL_CAN_OUTSEL OUTSEL;     /**< \brief 0, CAN Output Select Register */
} Ifx_GTM_INOUTSEL_CAN;

/** \\brief  DSADC */
typedef volatile struct _Ifx_GTM_INOUTSEL_DSADC
{
    Ifx_GTM_INOUTSEL_DSADC_INSEL INSEL[3];  /**< \brief 0, DSADC Input Select Register */
    Ifx_GTM_INOUTSEL_DSADC_OUTSEL OUTSEL00; /**< \brief C, DSADC Output Select 0 Register */
    unsigned char reserved_10[4];           /**< \brief 10, \internal Reserved */
    Ifx_GTM_INOUTSEL_DSADC_OUTSEL OUTSEL10; /**< \brief 14, DSADC Output Select 1 Register */
} Ifx_GTM_INOUTSEL_DSADC;

/** \\brief  PSI5 */
typedef volatile struct _Ifx_GTM_INOUTSEL_PSI5
{
    Ifx_GTM_INOUTSEL_PSI5_OUTSEL0 OUTSEL0;  /**< \brief 0, PSI5 Output Select 0 Register */
} Ifx_GTM_INOUTSEL_PSI5;

/** \\brief  PSI5S */
typedef volatile struct _Ifx_GTM_INOUTSEL_PSI5S
{
    Ifx_GTM_INOUTSEL_PSI5S_OUTSEL OUTSEL;   /**< \brief 0, PSI5-S Output Select Register */
} Ifx_GTM_INOUTSEL_PSI5S;

/** \\brief  Timer */
typedef volatile struct _Ifx_GTM_INOUTSEL_T
{
    Ifx_GTM_INOUTSEL_T_OUTSEL OUTSEL[15];   /**< \brief 0, Timer Output Select Register */
} Ifx_GTM_INOUTSEL_T;

/** \\brief  TIM */
typedef volatile struct _Ifx_GTM_INOUTSEL_TIM
{
    Ifx_GTM_INOUTSEL_TIM_INSEL INSEL;       /**< \brief 0, TIM Input Select Register */
} Ifx_GTM_INOUTSEL_TIM;

/** \\brief  MCS channel objects */
typedef volatile struct _Ifx_GTM_MCS_CH
{
    Ifx_GTM_MCS_CH_CTRL CTRL;               /**< \brief 0, MCS Channel Control Register */
    Ifx_GTM_MCS_CH_PC PC;                   /**< \brief 4, MCS Channel Program Counter Register */
    Ifx_GTM_MCS_CH_R0 R0;                   /**< \brief 8, MCS Channel Program Counter Register 0 */
    Ifx_GTM_MCS_CH_R1 R1;                   /**< \brief C, MCS Channel Program Counter Register 1 */
    Ifx_GTM_MCS_CH_R2 R2;                   /**< \brief 10, MCS Channel Program Counter Register 2 */
    Ifx_GTM_MCS_CH_R3 R3;                   /**< \brief 14, MCS Channel Program Counter Register 3 */
    Ifx_GTM_MCS_CH_R4 R4;                   /**< \brief 18, MCS Channel Program Counter Register 4 */
    Ifx_GTM_MCS_CH_R5 R5;                   /**< \brief 1C, MCS Channel Program Counter Register 5 */
    Ifx_GTM_MCS_CH_R6 R6;                   /**< \brief 20, MCS Channel Program Counter Register 6 */
    Ifx_GTM_MCS_CH_R7 R7;                   /**< \brief 24, MCS Channel Program Counter Register 7 */
    Ifx_GTM_MCS_CH_ACB ACB;                 /**< \brief 28, MCS Channel ACB Register */
    Ifx_GTM_MCS_CH_IRQ_NOTIFY IRQ_NOTIFY;   /**< \brief 2C, MCS Channel interrupt notification register */
    Ifx_GTM_MCS_CH_IRQ_EN IRQ_EN;           /**< \brief 30, MCS Channel Interrupt Enable Register */
    Ifx_GTM_MCS_CH_IRQ_FORCINT IRQ_FORCINT; /**< \brief 34, MCS Channel Software Interrupt Generation Register */
    Ifx_GTM_MCS_CH_IRQ_MODE IRQ_MODE;       /**< \brief 38, MCS IRQ Mode Configuration Register */
    unsigned char reserved_3C[68];          /**< \brief 3C, \internal Reserved */
} Ifx_GTM_MCS_CH;

/** \\brief  TIM channel objects */
typedef volatile struct _Ifx_GTM_TIM_CH
{
    Ifx_GTM_TIM_CH_CTRL CTRL;               /**< \brief 0, TIM Channel Control Register */
    Ifx_GTM_TIM_CH_FLT_RE FLT_RE;           /**< \brief 4, GTM_TIM Channel Filter Parameter 0 Register */
    Ifx_GTM_TIM_CH_FLT_FE FLT_FE;           /**< \brief 8, TIM Channel Filter Parameter 1 Register */
    Ifx_GTM_TIM_CH_TDU TDU;                 /**< \brief C, TIM Channel TDU Control Register */
    Ifx_GTM_TIM_CH_GPR0 GPR0;               /**< \brief 10, TIM Channel General Purpose 0 Register */
    Ifx_GTM_TIM_CH_GPR1 GPR1;               /**< \brief 14, TIM Channel General Purpose 1 Register */
    Ifx_GTM_TIM_CH_CNT CNT;                 /**< \brief 18, TIM Channel SMU Counter Register */
    Ifx_GTM_TIM_CH_CNTS CNTS;               /**< \brief 1C, TIM Channel SMU Shadow Counter Register */
    Ifx_GTM_TIM_CH_IRQ_NOTIFY IRQ_NOTIFY;   /**< \brief 20, TIM Channel Interrupt Notification Register */
    Ifx_GTM_TIM_CH_IRQ_EN IRQ_EN;           /**< \brief 24, TIM Channel Interrupt Enable Register */
    Ifx_GTM_TIM_CH_IRQ_FORCINT IRQ_FORCINT; /**< \brief 28, TIM Channel Software Interrupt Force Register */
    Ifx_GTM_TIM_CH_IRQ_MODE IRQ_MODE;       /**< \brief 2C, TIM IRQ Mode Configuration Register */
    unsigned char reserved_30[80];          /**< \brief 30, \internal Reserved */
} Ifx_GTM_TIM_CH;

