HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxGtm_regdef.h
/** \\brief  TOM channel objects */
typedef volatile struct _Ifx_GTM_TOM_CH
{
    Ifx_GTM_TOM_CH_CTRL CTRL;               /**< \brief 0, TOM Channel Control Register’ */
    Ifx_GTM_TOM_CH_CN0 CN0;                 /**< \brief 4, TOM Channel CCU0 Counter Register */
    Ifx_GTM_TOM_CH_CM0 CM0;                 /**< \brief 8, TOM Channel CCU0 Compare Register */
    Ifx_GTM_TOM_CH_SR0 SR0;                 /**< \brief C, TOM Channel CCU0 Compare Shadow Register */
    Ifx_GTM_TOM_CH_CM1 CM1;                 /**< \brief 10, TOM Channel CCU1 Compare Register */
    Ifx_GTM_TOM_CH_SR1 SR1;                 /**< \brief 14, TOM Channel CCU1 Compare Shadow Register */
    Ifx_GTM_TOM_CH_STAT STAT;               /**< \brief 18, TOM Channel Status Register */
    Ifx_GTM_TOM_CH_IRQ_NOTIFY IRQ_NOTIFY;   /**< \brief 1C, TOM Channel Interrupt Notification Register */
    Ifx_GTM_TOM_CH_IRQ_EN IRQ_EN;           /**< \brief 20, TOM Channel Interrupt Enable Register */
    Ifx_GTM_TOM_CH_IRQ_FORCINT IRQ_FORCINT; /**< \brief 24, TOM Channel Software Interrupt Generation Register */
    Ifx_GTM_TOM_CH_IRQ_MODE IRQ_MODE;       /**< \brief 28, TOM IRQ Mode Configuration Register */
    unsigned char reserved_2C[20];          /**< \brief 2C, \internal Reserved */
} Ifx_GTM_TOM_CH;

/** \\brief  TOM channel objects */
typedef volatile struct _Ifx_GTM_TOM_CH15
{
    Ifx_GTM_TOM_CH15_CTRL CTRL;             /**< \brief 0, TOM Channel Control Register */
    Ifx_GTM_TOM_CH15_CN0 CN0;               /**< \brief 4, TOM Channel CCU0 Counter Register */
    Ifx_GTM_TOM_CH15_CM0 CM0;               /**< \brief 8, TOM Channel CCU0 Compare Register */
    Ifx_GTM_TOM_CH15_SR0 SR0;               /**< \brief C, TOM Channel CCU0 Compare Shadow Register */
    Ifx_GTM_TOM_CH15_CM1 CM1;               /**< \brief 10, TOM Channel CCU1 Compare Register */
    Ifx_GTM_TOM_CH15_SR1 SR1;               /**< \brief 14, TOM Channel CCU1 Compare Shadow Register */
    Ifx_GTM_TOM_CH15_STAT STAT;             /**< \brief 18, TOM Channel Status Register */
    Ifx_GTM_TOM_CH15_IRQ_NOTIFY IRQ_NOTIFY; /**< \brief 1C, TOM Channel Interrupt Notification Register */
    Ifx_GTM_TOM_CH15_IRQ_EN IRQ_EN;         /**< \brief 20, TOM Channel Interrupt Enable Register */
    Ifx_GTM_TOM_CH15_IRQ_FORCINT IRQ_FORCINT;   /**< \brief 24, TOM Channel Software Interrupt Generation Register */
    Ifx_GTM_TOM_CH15_IRQ_MODE IRQ_MODE;     /**< \brief 28, TOM IRQ Mode Configuration Register */
} Ifx_GTM_TOM_CH15;

/** \\brief  TOM TGC objects */
typedef volatile struct _Ifx_GTM_TOM_TGC
{
    Ifx_GTM_TOM_TGC_GLB_CTRL GLB_CTRL;      /**< \brief 0, TOM TGC Global Control Register */
    Ifx_GTM_TOM_TGC_ENDIS_CTRL ENDIS_CTRL;  /**< \brief 4, TOM TGC Enable/Disable Control Register */
    Ifx_GTM_TOM_TGC_ENDIS_STAT ENDIS_STAT;  /**< \brief 8, TOM TGC Enable/Disable Status Register */
    Ifx_GTM_TOM_TGC_ACT_TB ACT_TB;          /**< \brief C, TOM TGC Action Time Base Register */
    Ifx_GTM_TOM_TGC_OUTEN_CTRL OUTEN_CTRL;  /**< \brief 10, TOM TGC Output Enable Control Register */
    Ifx_GTM_TOM_TGC_OUTEN_STAT OUTEN_STAT;  /**< \brief 14, TOM TGC Output Enable Status Register */
    Ifx_GTM_TOM_TGC_FUPD_CTRL FUPD_CTRL;    /**< \brief 18, TOM TGC Force Update Control Register */
    Ifx_GTM_TOM_TGC_INT_TRIG INT_TRIG;      /**< \brief 1C, TOM TGC Internal Trigger Control Register */
    unsigned char reserved_20[32];          /**< \brief 20, \internal Reserved */
} Ifx_GTM_TOM_TGC;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Gtm_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */

/** \\brief  AFD object */
typedef volatile struct _Ifx_GTM_AFD
{
    Ifx_GTM_AFD_CH CH[8];                   /**< \brief 0, AFD FIFO channel objects */
} Ifx_GTM_AFD;

/** \\brief  ARU object */
typedef volatile struct _Ifx_GTM_ARU
{
    Ifx_GTM_ARU_ARU_ACCESS ARU_ACCESS;      /**< \brief 0, ARU Access Register */
    Ifx_GTM_ARU_DATA_H DATA_H;              /**< \brief 4, ARU Access Register Upper Data Word */
    Ifx_GTM_ARU_DATA_L DATA_L;              /**< \brief 8, ARU Access Register Lower Data Word */
    Ifx_GTM_ARU_DBG_ACCESS0 DBG_ACCESS0;    /**< \brief C, Debug Access Channel 0 */
    Ifx_GTM_ARU_DBG_DATA0_H DBG_DATA0_H;    /**< \brief 10, Debug Access 0 Transfer Register Upper Data Word */
    Ifx_GTM_ARU_DBG_DATA0_L DBG_DATA0_L;    /**< \brief 14, Debug Access 0 Transfer Register Lower Data Word */
    Ifx_GTM_ARU_DBG_ACCESS1 DBG_ACCESS1;    /**< \brief 18, Debug Access Channel 0 */
    Ifx_GTM_ARU_DBG_DATA1_H DBG_DATA1_H;    /**< \brief 1C, Debug Access 1 Transfer Register Upper Data Word */
    Ifx_GTM_ARU_DBG_DATA1_L DBG_DATA1_L;    /**< \brief 20, Debug Access 1 Transfer Register Lower Data Word */
    Ifx_GTM_ARU_IRQ_NOTIFY IRQ_NOTIFY;      /**< \brief 24, ARU Interrupt Notification Register */
    Ifx_GTM_ARU_IRQ_EN IRQ_EN;              /**< \brief 28, ARU Interrupt Enable Register */
    Ifx_GTM_ARU_IRQ_FORCINT IRQ_FORCINT;    /**< \brief 2C, ARU_NEW_DATA_IRQ Forcing Interrupt Register */
    Ifx_GTM_ARU_IRQ_MODE IRQ_MODE;          /**< \brief 30, IRQ Mode Configuration Register */
} Ifx_GTM_ARU;

/** \\brief  ATOM objects */
typedef volatile struct _Ifx_GTM_ATOM
{
    Ifx_GTM_ATOM_AGC AGC;                   /**< \brief 0, ATOM AGC objects */
    Ifx_GTM_ATOM_CH CH[8];                  /**< \brief 80, ATOM channel objects */
    unsigned char reserved_480[896];        /**< \brief 480, \internal Reserved */
} Ifx_GTM_ATOM;

/** \\brief  BRC object */
typedef volatile struct _Ifx_GTM_BRC
{
    Ifx_GTM_BRC_SRC SRC[12];                /**< \brief 0, BRC input channel objects */
    Ifx_GTM_BRC_IRQ_NOTIFY IRQ_NOTIFY;      /**< \brief 60, BRC Interrupt Notification Register */
    Ifx_GTM_BRC_IRQ_EN IRQ_EN;              /**< \brief 64, BRC Interrupt Enable Register */
    Ifx_GTM_BRC_IRQ_FORCINT IRQ_FORCINT;    /**< \brief 68, BRC_DEST_ERR Forcing Interrupt Register */
    Ifx_GTM_BRC_IRQ_MODE IRQ_MODE;          /**< \brief 6C, BRC IRQ Mode Configuration Register */
    Ifx_GTM_BRC_RST RST;                    /**< \brief 70, BRC Software Reset Register */
} Ifx_GTM_BRC;

/** \\brief  BRIDGE object */
typedef volatile struct _Ifx_GTM_BRIDGE
{
    Ifx_GTM_BRIDGE_MODE MODE;               /**< \brief 0, GTM to SPB BRIDGE MODE */
    Ifx_GTM_BRIDGE_PTR1 PTR1;               /**< \brief 4, GTM to SPB BRIDGE PTR1 */
    Ifx_GTM_BRIDGE_PTR2 PTR2;               /**< \brief 8, GTM to SPB BRIDGE PTR2 */
} Ifx_GTM_BRIDGE;

/** \\brief  CMP object */
typedef volatile struct _Ifx_GTM_CMP
{
    Ifx_GTM_CMP_EN EN;                      /**< \brief 0, CMP Comparator Enable Register */
    Ifx_GTM_CMP_IRQ_NOTIFY IRQ_NOTIFY;      /**< \brief 4, CMP Event Notification Register */
    Ifx_GTM_CMP_IRQ_EN IRQ_EN;              /**< \brief 8, CMP Interrupt Enable Register */
    Ifx_GTM_CMP_IRQ_FORCINT IRQ_FORCINT;    /**< \brief C, CMP Interrupt Force Register */
    Ifx_GTM_CMP_IRQ_MODE IRQ_MODE;          /**< \brief 10, CMP IRQ Mode Configuration Register */
} Ifx_GTM_CMP;

/** \\brief  CMU object */
typedef volatile struct _Ifx_GTM_CMU
{
    Ifx_GTM_CMU_CLK_EN CLK_EN;              /**< \brief 0, CMU Clock Enable Register */
    Ifx_GTM_CMU_GCLK_NUM GCLK_NUM;          /**< \brief 4, CMU Global Clock Control Numerator Register */
    Ifx_GTM_CMU_GCLK_DEN GCLK_DEN;          /**< \brief 8, CMU Global Clock Control Denominator Register */
    Ifx_GTM_CMU_CLK0_4 CLK0_4[5];           /**< \brief C, CLK objects */
    Ifx_GTM_CMU_CLK_5 CLK_5;                /**< \brief 20, CLK objects */
    Ifx_GTM_CMU_CLK_6 CLK_6;                /**< \brief 24, CLK objects */
    Ifx_GTM_CMU_CLK_7 CLK_7;                /**< \brief 28, CLK objects */
    Ifx_GTM_CMU_ECLK ECLK[3];               /**< \brief 2C, ECLK objects */
} Ifx_GTM_CMU;

/** \\brief  DPLL object */
typedef volatile struct _Ifx_GTM_DPLL
{
    Ifx_GTM_DPLL_CTRL_0 CTRL_0;             /**< \brief 0, DPLL Control Register 0 */
    Ifx_GTM_DPLL_CTRL_1 CTRL_1;             /**< \brief 4, DPLL Control Register 1 */
    Ifx_GTM_DPLL_CTRL_2 CTRL_2;             /**< \brief 8, DPLL Control Register 2 */
    Ifx_GTM_DPLL_CTRL_3 CTRL_3;             /**< \brief C, DPLL Control Register 3 */
    Ifx_GTM_DPLL_CTRL_4 CTRL_4;             /**< \brief 10, DPLL Control Register 4 */
    Ifx_GTM_DPLL_STATUS STATUS;             /**< \brief 14, DPLL Status Register */
    Ifx_GTM_DPLL_ACT_STA ACT_STA;           /**< \brief 18, DPLL ACTION Status Register With Shadow Register */
    Ifx_GTM_DPLL_OSW OSW;                   /**< \brief 1C, DPLL Offset And Switch Old/New Address Register */
    Ifx_GTM_DPLL_AOSV_2 AOSV_2;             /**< \brief 20, DPLL Address Offset Register For APT In RAM Region 2 */
    Ifx_GTM_DPLL_APT APT;                   /**< \brief 24, DPLL Actual RAM Pointer to RAM Regions 2a, b and d */
    Ifx_GTM_DPLL_APS APS;                   /**< \brief 28, DPLL Actual RAM Pointer to RAM Regions 1c1, 1c2 and 1c4 */
    Ifx_GTM_DPLL_APT_2c APT_2c;             /**< \brief 2C, DPLL Actual RAM Pointer to RAM Region 2c */
    Ifx_GTM_DPLL_APS_1c3 APS_1c3;           /**< \brief 30, DPLL Actual RAM Pointer to RAM Region 1c3 */
    Ifx_GTM_DPLL_NUTC NUTC;                 /**< \brief 34, DPLL Number of Recent TRIGGER Events Used for Calculations */
    Ifx_GTM_DPLL_NUSC NUSC;                 /**< \brief 38, DPLL Number of Recent STATE Events Used for Calculations */
    Ifx_GTM_DPLL_NTI_CNT NTI_CNT;           /**< \brief 3C, DPLL Number of Active TRIGGER Events to Interrupt */
    Ifx_GTM_DPLL_IRQ_NOTIFY IRQ_NOTIFY;     /**< \brief 40, DPLL Interrupt Notification Register */
    Ifx_GTM_DPLL_IRQ_EN IRQ_EN;             /**< \brief 44, DPLL Interrupt Enable Register */
    Ifx_GTM_DPLL_IRQ_FORCINT IRQ_FORCINT;   /**< \brief 48, DPLL Interrupt Force Register */
    Ifx_GTM_DPLL_IRQ_MODE IRQ_MODE;         /**< \brief 4C, DPLL Interrupt Mode Register */
    Ifx_GTM_DPLL_ID_PMTR ID_PMTR[24];       /**< \brief 50, DPLL ID Information For Input Signal PMTR n Register */
    Ifx_GTM_DPLL_INC_CNT1 INC_CNT1;         /**< \brief B0, DPLL Counter for Pulses for TBU_TS1 to be sent in Automatic End Mode */
    Ifx_GTM_DPLL_INC_CNT2 INC_CNT2;         /**< \brief B4, DPLL Counter for Pulses for TBU_TS2 to be sent in Automatic End Mode when SMC=RMO=1 */
    Ifx_GTM_DPLL_APT_SYNC APT_SYNC;         /**< \brief B8, DPLL Old RAM Pointer and Offset Value for TRIGGER */
    Ifx_GTM_DPLL_APS_SYNC APS_SYNC;         /**< \brief BC, DPLL Old RAM Pointer and Offset Value for STATE */
    Ifx_GTM_DPLL_TBU_TS0_T TBU_TS0_T;       /**< \brief C0, DPLL TBU_TS0 Value at last TRIGGER Event */
    Ifx_GTM_DPLL_TBU_TS0_S TBU_TS0_S;       /**< \brief C4, DPLL TBU_TS0 Value at last STATE Event */
    Ifx_GTM_DPLL_ADD_IN_LD1 ADD_IN_LD1;     /**< \brief C8, DPLL Direct Load Input Value for SUB_INC1 */
    Ifx_GTM_DPLL_ADD_IN_LD2 ADD_IN_LD2;     /**< \brief CC, DPLL Direct Load Input Value for SUB_INC1 */
    unsigned char reserved_D0[48];          /**< \brief D0, \internal Reserved */
    Ifx_GTM_DPLL_TSA TSA[24];               /**< \brief 100, Calculated Time Stamp For ACTION_i Register */
    Ifx_GTM_DPLL_PSAC PSAC[24];             /**< \brief 160, Calculated Position Value for ACTION_i Register */
    Ifx_GTM_DPLL_ACB ACB[6];                /**< \brief 1C0, Control Bits For Actions Register i */
    unsigned char reserved_1D8[8];          /**< \brief 1D8, \internal Reserved */
    Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER CTRL_0_SHADOW_TRIGGER;   /**< \brief 1E0, DPLL Control0 Shadow Trigger Register */
    Ifx_GTM_DPLL_CTRL_0_SHADOW_STATE CTRL_0_SHADOW_STATE;   /**< \brief 1E4, DPLL Control 0 Shadow STATE Register */
    Ifx_GTM_DPLL_CTRL_1_SHADOW_TRIGGER CTRL_1_SHADOW_TRIGGER;   /**< \brief 1E8, DPLL Control 1 Shadow TRIGGER Register */
    Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE CRTL_1_SHADOW_STATE;   /**< \brief 1EC, DPLL Control 1 Shadow STATE Register */
    unsigned char reserved_1F0[12];         /**< \brief 1F0, \internal Reserved */
    Ifx_GTM_DPLL_RAM_INI RAM_INI;           /**< \brief 1FC, DPLL RAM Initatlisation Register */
} Ifx_GTM_DPLL;

/** \\brief  F2A object */
typedef volatile struct _Ifx_GTM_F2A
{
    Ifx_GTM_F2A_RD_CH RD_CH[8];             /**< \brief 0, F2A ARU RD FIFO address */
    Ifx_GTM_F2A_STR_CH STR_CH[8];           /**< \brief 20, F2A Stream configuration */
    Ifx_GTM_F2A_ENABLE ENABLE;              /**< \brief 40, F2A0 Stream Activation Register */
} Ifx_GTM_F2A;

