HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxGtm_regdef.h
/** \\brief  FIFO object */
typedef volatile struct _Ifx_GTM_FIFO
{
    Ifx_GTM_FIFO_CH CH[8];                  /**< \brief 0, FIFO channel */
    Ifx_GTM_FIFO_CH_PTR CH_PTR[8];          /**< \brief 100, FIFO channel pointer objects */
    Ifx_GTM_FIFO_CH_IRQ CH_IRQ[8];          /**< \brief 200, FIFO channel interrupt objects */
} Ifx_GTM_FIFO;

/** \\brief  ICM object */
typedef volatile struct _Ifx_GTM_ICM
{
    Ifx_GTM_ICM_IRQG_0 IRQG_0;              /**< \brief 0, GTM Infrastructure Interrupt Group */
    Ifx_GTM_ICM_IRQG_1 IRQG_1;              /**< \brief 4, GTM DPLL Interrupt Group */
    Ifx_GTM_ICM_IRQG_2 IRQG_2;              /**< \brief 8, TIM Interrupt Group 0 */
    unsigned char reserved_C[4];            /**< \brief C, \internal Reserved */
    Ifx_GTM_ICM_IRQG_4 IRQG_4;              /**< \brief 10, MCS Interrupt Group 0 */
    unsigned char reserved_14[4];           /**< \brief 14, \internal Reserved */
    Ifx_GTM_ICM_IRQG_6 IRQG_6;              /**< \brief 18, TOM Interrupt Group 0 */
    Ifx_GTM_ICM_IRQG_7 IRQG_7;              /**< \brief 1C, ITOM Interrupt Group 1 */
    unsigned char reserved_20[4];           /**< \brief 20, \internal Reserved */
    Ifx_GTM_ICM_IRQG_9 IRQG_9;              /**< \brief 24, ATOM Interrupt Group 0 */
    Ifx_GTM_ICM_IRQG_10 IRQG_10;            /**< \brief 28, ATOM Interrupt Group 1 */
} Ifx_GTM_ICM;

/** \\brief  INSEL / OUTSEL object */
typedef volatile struct _Ifx_GTM_INOUTSEL
{
    Ifx_GTM_INOUTSEL_TIM TIM[4];            /**< \brief 0, TIM */
    unsigned char reserved_10[16];          /**< \brief 10, \internal Reserved */
    Ifx_GTM_INOUTSEL_T T;                   /**< \brief 20, Timer */
    unsigned char reserved_5C[16];          /**< \brief 5C, \internal Reserved */
    Ifx_GTM_INOUTSEL_DSADC DSADC;           /**< \brief 6C, DSADC */
    unsigned char reserved_84[12];          /**< \brief 84, \internal Reserved */
    Ifx_GTM_INOUTSEL_CAN CAN;               /**< \brief 90, CAN */
    Ifx_GTM_INOUTSEL_PSI5 PSI5;             /**< \brief 94, PSI5 */
    Ifx_GTM_INOUTSEL_PSI5S PSI5S;           /**< \brief 98, PSI5S */
} Ifx_GTM_INOUTSEL;

/** \\brief  MCS objects */
typedef volatile struct _Ifx_GTM_MCS
{
    Ifx_GTM_MCS_CH CH[8];                   /**< \brief 0, MCS channel objects */
    Ifx_GTM_MCS_CTRL CTRL;                  /**< \brief 400, MCS Control Register */
    Ifx_GTM_MCS_CTRG CTRG;                  /**< \brief 404, MCS Clear Trigger Control Register */
    Ifx_GTM_MCS_STRG STRG;                  /**< \brief 408, MCS Set Trigger Control Register */
    Ifx_GTM_MCS_RST RST;                    /**< \brief 40C, MCS Channel Reset Register */
    Ifx_GTM_MCS_ERR ERR;                    /**< \brief 410, MCS Error Register */
    unsigned char reserved_414[64492];      /**< \brief 414, \internal Reserved */
} Ifx_GTM_MCS;

/** \\brief  MON object */
typedef volatile struct _Ifx_GTM_MON
{
    Ifx_GTM_MON_STATUS STATUS;              /**< \brief 0, Monitor Status Register */
    Ifx_GTM_MON_ACTIVITY_0 ACTIVITY_0;      /**< \brief 4, Monitor Activity Register 0 */
} Ifx_GTM_MON;

/** \\brief  MSC input */
typedef volatile struct _Ifx_GTM_MSCIN
{
    Ifx_GTM_MSCIN_INLCON INLCON;            /**< \brief 0, MSC Input Low Control Register */
    Ifx_GTM_MSCIN_INHCON INHCON;            /**< \brief 4, MSC Input High Control Register */
} Ifx_GTM_MSCIN;

/** \\brief  MSC objects */
typedef volatile struct _Ifx_GTM_MSCSET
{
    Ifx_GTM_MSCSET_CON0 CON0;               /**< \brief 0, MSC Set Control 0 Register */
    Ifx_GTM_MSCSET_CON1 CON1;               /**< \brief 4, MSC Set Control 1 Register */
    Ifx_GTM_MSCSET_CON2 CON2;               /**< \brief 8, MSC Set Control 2 Register */
    Ifx_GTM_MSCSET_CON3 CON3;               /**< \brief C, MSC Set Control 3 Register */
} Ifx_GTM_MSCSET;

/** \\brief  SPE objects */
typedef volatile struct _Ifx_GTM_SPE
{
    Ifx_GTM_SPE_CTRL_STAT CTRL_STAT;        /**< \brief 0, SPE Control Status Register */
    Ifx_GTM_SPE_PAT PAT;                    /**< \brief 4, SPE Input Pattern Definition Register */
    Ifx_GTM_SPE_OUT_PAT OUT_PAT[8];         /**< \brief 8, SPE Output Definition Register r */
    Ifx_GTM_SPE_OUT_CTRL OUT_CTRL;          /**< \brief 28, SPE Output Control Register */
    Ifx_GTM_SPE_IRQ_NOTIFY IRQ_NOTIFY;      /**< \brief 2C, SPE Interrupt Notification Register */
    Ifx_GTM_SPE_IRQ_EN IRQ_EN;              /**< \brief 30, SPE Interrupt Enable Register */
    Ifx_GTM_SPE_IRQ_FORCINT IRQ_FORCINT;    /**< \brief 34, SPE Interrupt Generation by Software */
    Ifx_GTM_SPE_IRQ_MODE IRQ_MODE;          /**< \brief 38, SPE IRQ Mode Configuration Register */
    unsigned char reserved_3C[68];          /**< \brief 3C, \internal Reserved */
} Ifx_GTM_SPE;

/** \\brief  TBU object */
typedef volatile struct _Ifx_GTM_TBU
{
    Ifx_GTM_TBU_CHEN CHEN;                  /**< \brief 0, TBU Global Channel Enable Register */
    Ifx_GTM_TBU_CH0_CTRL CH0_CTRL;          /**< \brief 4, TBU Channel 0 Control Register */
    Ifx_GTM_TBU_CH0_BASE CH0_BASE;          /**< \brief 8, TBU Channel 0 Base Register */
    Ifx_GTM_TBU_CH1_CTRL CH1_CTRL;          /**< \brief C, TBU Channel 1 Control Register */
    Ifx_GTM_TBU_CH1_BASE CH1_BASE;          /**< \brief 10, TBU Channel 1 Base Register */
    Ifx_GTM_TBU_CH2_CTRL CH2_CTRL;          /**< \brief 14, TBU Channel 2 Control Register */
    Ifx_GTM_TBU_CH2_BASE CH2_BASE;          /**< \brief 18, TBU Channel 2 Base Register */
} Ifx_GTM_TBU;

/** \\brief  TIM objects */
typedef volatile struct _Ifx_GTM_TIM
{
    Ifx_GTM_TIM_CH CH[8];                   /**< \brief 0, TIM channel objects */
    Ifx_GTM_TIM_RST RST;                    /**< \brief 400, TIM Global Software Reset Register */
    unsigned char reserved_404[1020];       /**< \brief 404, \internal Reserved */
} Ifx_GTM_TIM;

/** \\brief  TOM objects */
typedef volatile struct _Ifx_GTM_TOM
{
    Ifx_GTM_TOM_TGC TGC[2];                 /**< \brief 0, TOM TGC objects */
    Ifx_GTM_TOM_CH CH[15];                  /**< \brief 80, TOM channel objects */
    Ifx_GTM_TOM_CH15 CH15;                  /**< \brief 440, TOM channel objects */
    unsigned char reserved_46C[916];        /**< \brief 46C, \internal Reserved */
} Ifx_GTM_TOM;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Gtm_struct
 * \{  */
/******************************************************************************/
/** \name Object L0
 * \{  */

