HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxGtm_regdef.h
/** \\brief  GTM object */
typedef volatile struct _Ifx_GTM
{
    Ifx_GTM_REV REV;                        /**< \brief 0, GTM Version Control Register */
    Ifx_GTM_RST RST;                        /**< \brief 4, GTM Global Reset Register */
    Ifx_GTM_CTRL CTRL;                      /**< \brief 8, GTM Global Control Register */
    Ifx_GTM_AEI_ADDR_XPT AEI_ADDR_XPT;      /**< \brief C, GTM AEI Timeout Exception Address Register */
    Ifx_GTM_IRQ_NOTIFY IRQ_NOTIFY;          /**< \brief 10, GTM Interrupt Notification Register */
    Ifx_GTM_IRQ_EN IRQ_EN;                  /**< \brief 14, GTM Interrupt Enable Register */
    Ifx_GTM_IRQ_FORCINT IRQ_FORCINT;        /**< \brief 18, GTM Software Interrupt Generation Register */
    Ifx_GTM_IRQ_MODE IRQ_MODE;              /**< \brief 1C, GTM Top Level Interrupts Mode Selection */
    unsigned char reserved_20[16];          /**< \brief 20, \internal Reserved */
    Ifx_GTM_BRIDGE BRIDGE;                  /**< \brief 30, BRIDGE object */
    unsigned char reserved_3C[4];           /**< \brief 3C, \internal Reserved */
    Ifx_GTM_MAP_CTRL MAP_CTRL;              /**< \brief 40, MAP Control Register */
    unsigned char reserved_44[60];          /**< \brief 44, \internal Reserved */
    Ifx_GTM_MCFG_CTRL MCFG_CTRL;            /**< \brief 80, Memory Layout Configuration Register */
    unsigned char reserved_84[124];         /**< \brief 84, \internal Reserved */
    Ifx_GTM_TBU TBU;                        /**< \brief 100, TBU object */
    unsigned char reserved_11C[100];        /**< \brief 11C, \internal Reserved */
    Ifx_GTM_MON MON;                        /**< \brief 180, MON object */
    unsigned char reserved_188[120];        /**< \brief 188, \internal Reserved */
    Ifx_GTM_CMP CMP;                        /**< \brief 200, CMP object */
    unsigned char reserved_214[108];        /**< \brief 214, \internal Reserved */
    Ifx_GTM_ARU ARU;                        /**< \brief 280, ARU object */
    unsigned char reserved_2B4[76];         /**< \brief 2B4, \internal Reserved */
    Ifx_GTM_CMU CMU;                        /**< \brief 300, CMU object */
    unsigned char reserved_344[188];        /**< \brief 344, \internal Reserved */
    Ifx_GTM_BRC BRC;                        /**< \brief 400, BRC object */
    unsigned char reserved_474[396];        /**< \brief 474, \internal Reserved */
    Ifx_GTM_ICM ICM;                        /**< \brief 600, ICM object */
    unsigned char reserved_62C[468];        /**< \brief 62C, \internal Reserved */
    Ifx_GTM_SPE SPE[2];                     /**< \brief 800, SPE objects */
    unsigned char reserved_900[1792];       /**< \brief 900, \internal Reserved */
    Ifx_GTM_TIM TIM[4];                     /**< \brief 1000, TIM objects */
    unsigned char reserved_3000[20480];     /**< \brief 3000, \internal Reserved */
    Ifx_GTM_TOM TOM[3];                     /**< \brief 8000, TOM objects */
    unsigned char reserved_9800[14336];     /**< \brief 9800, \internal Reserved */
    Ifx_GTM_ATOM ATOM[5];                   /**< \brief D000, ATOM objects */
    unsigned char reserved_F800[34816];     /**< \brief F800, \internal Reserved */
    Ifx_GTM_F2A F2A0;                       /**< \brief 18000, F2A object */
    unsigned char reserved_18044[60];       /**< \brief 18044, \internal Reserved */
    Ifx_GTM_AFD AFD0;                       /**< \brief 18080, AFD object */
    unsigned char reserved_18100[768];      /**< \brief 18100, \internal Reserved */
    Ifx_GTM_FIFO FIFO0;                     /**< \brief 18400, FIFO object */
    unsigned char reserved_18700[63744];    /**< \brief 18700, \internal Reserved */
    Ifx_GTM_DPLL DPLL;                      /**< \brief 28000, DPLL object */
    unsigned char reserved_28200[32256];    /**< \brief 28200, \internal Reserved */
    Ifx_GTM_MCS MCS[4];                     /**< \brief 30000, MCS objects */
    unsigned char reserved_70000[195840];   /**< \brief 70000, \internal Reserved */
    Ifx_GTM_CLC CLC;                        /**< \brief 9FD00, Clock Control Register */
    unsigned char reserved_9FD04[12];       /**< \brief 9FD04, \internal Reserved */
    Ifx_GTM_INOUTSEL INOUTSEL;              /**< \brief 9FD10, INSEL / OUTSEL object */
    unsigned char reserved_9FDAC[4];        /**< \brief 9FDAC, \internal Reserved */
    Ifx_GTM_ADCTRIG0OUT0 ADCTRIG0OUT0;      /**< \brief 9FDB0, ADC Trigger 0 Output Select 0 Register */
    Ifx_GTM_ADCTRIG0OUT1 ADCTRIG0OUT1;      /**< \brief 9FDB4, ADC Trigger 0 Output Select 1 Register */
    Ifx_GTM_ADCTRIG1OUT0 ADCTRIG1OUT0;      /**< \brief 9FDB8, ADC Trigger 1 Output Select 0 Register */
    Ifx_GTM_ADCTRIG1OUT1 ADCTRIG1OUT1;      /**< \brief 9FDBC, ADC Trigger 1 Output Select 1 Register */
    unsigned char reserved_9FDC0[4];        /**< \brief 9FDC0, \internal Reserved */
    Ifx_GTM_OTBU0T OTBU0T;                  /**< \brief 9FDC4, OCDS TBU0 Trigger Register */
    Ifx_GTM_OTBU1T OTBU1T;                  /**< \brief 9FDC8, OCDS TBU1 Trigger Register */
    Ifx_GTM_OTBU2T OTBU2T;                  /**< \brief 9FDCC, OCDS TBU2 Trigger Register */
    Ifx_GTM_OTSS OTSS;                      /**< \brief 9FDD0, OCDS Trigger Set Select Register */
    Ifx_GTM_OTSC0 OTSC0;                    /**< \brief 9FDD4, OCDS Trigger Set Control 0 Register */
    Ifx_GTM_OTSC1 OTSC1;                    /**< \brief 9FDD8, OCDS Trigger Set Control 1 Register */
    Ifx_GTM_ODA ODA;                        /**< \brief 9FDDC, OCDS Debug Access Register */
    unsigned char reserved_9FDE0[8];        /**< \brief 9FDE0, \internal Reserved */
    Ifx_GTM_OCS OCS;                        /**< \brief 9FDE8, OCDS Control and Status */
    Ifx_GTM_KRSTCLR KRSTCLR;                /**< \brief 9FDEC, Kernel Reset Status Clear Register */
    Ifx_GTM_KRST1 KRST1;                    /**< \brief 9FDF0, Kernel Reset Register 1 */
    Ifx_GTM_KRST0 KRST0;                    /**< \brief 9FDF4, Kernel Reset Register 0 */
    Ifx_GTM_ACCEN1 ACCEN1;                  /**< \brief 9FDF8, Access Enable Register 1 */
    Ifx_GTM_ACCEN0 ACCEN0;                  /**< \brief 9FDFC, Access Enable Register 0 */
    unsigned char reserved_9FE00[256];      /**< \brief 9FE00, \internal Reserved */
    Ifx_GTM_MSCSET MSCSET_1S[4];            /**< \brief 9FF00, MSC objects \note Array index shifted by 1. Example: defined register MSCSET_1S[0]/MSCSET_1S0 corresponds to user manual MSCSET_1S1, ... */
    unsigned char reserved_9FF40[32];       /**< \brief 9FF40, \internal Reserved */
    Ifx_GTM_MSCIN MSCIN[2];                 /**< \brief 9FF60, MSC input */
    unsigned char reserved_9FF70[144];      /**< \brief 9FF70, \internal Reserved */
} Ifx_GTM;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXGTM_REGDEF_H */
